; ModuleID = 'util/crc32c.cc'
source_filename = "util/crc32c.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

@_ZGVZN7leveldb6crc32c6ExtendEjPKcmE10accelerate = internal global i64 0, align 8

!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !181, file: !184, line: 60)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !182, line: 7, baseType: !183)
!182 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/clock_t.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !11, line: 144, baseType: !129)
!184 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ctime", directory: "")
!185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !186, file: !184, line: 61)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !187, line: 7, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !11, line: 148, baseType: !129)
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !190, file: !184, line: 62)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !191, line: 7, size: 448, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !193, file: !184, line: 64)
!193 = !DISubprogram(name: "clock", scope: !194, file: !194, line: 72, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DIFile(filename: "/usr/include/time.h", directory: "")
!195 = !DISubroutineType(types: !196)
!196 = !{!181}
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !198, file: !184, line: 65)
!198 = !DISubprogram(name: "difftime", scope: !194, file: !194, line: 78, type: !199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !186, !186}
!201 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!202 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !203, file: !184, line: 66)
!203 = !DISubprogram(name: "mktime", scope: !194, file: !194, line: 82, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!204 = !DISubroutineType(types: !205)
!205 = !{!186, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !208, file: !184, line: 67)
!208 = !DISubprogram(name: "time", scope: !194, file: !194, line: 75, type: !209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!209 = !DISubroutineType(types: !210)
!210 = !{!186, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !213, file: !184, line: 68)
!213 = !DISubprogram(name: "asctime", scope: !194, file: !194, line: 139, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !220, file: !184, line: 69)
!220 = !DISubprogram(name: "ctime", scope: !194, file: !194, line: 142, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubroutineType(types: !222)
!222 = !{!216, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !226, file: !184, line: 70)
!226 = !DISubprogram(name: "gmtime", scope: !194, file: !194, line: 119, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{!206, !223}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !230, file: !184, line: 71)
!230 = !DISubprogram(name: "localtime", scope: !194, file: !194, line: 123, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !232, file: !184, line: 72)
!232 = !DISubprogram(name: "strftime", scope: !194, file: !194, line: 88, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{!51, !235, !51, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !216)
!236 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !42)
!237 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !217)
!238 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !239, entity: !240, file: !242, line: 977)
!239 = !DINamespace(name: "chrono", scope: !108)
!240 = !DINamespace(name: "chrono_literals", scope: !241, exportSymbols: true)
!241 = !DINamespace(name: "literals", scope: !108, exportSymbols: true)
!242 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/chrono", directory: "")
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !244, file: !259, line: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !245, line: 6, baseType: !246)
!245 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !247, line: 21, baseType: !248)
!247 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !249, identifier: "_ZTS11__mbstate_t")
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !248, file: !247, line: 15, baseType: !66, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !248, file: !247, line: 20, baseType: !252, size: 32, offset: 32)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !248, file: !247, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !253, identifier: "_ZTSN11__mbstate_tUt_E")
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !252, file: !247, line: 18, baseType: !12, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !252, file: !247, line: 19, baseType: !256, size: 32)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cwchar", directory: "")
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !261, file: !259, line: 139)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !262, line: 20, baseType: !12)
!262 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !264, file: !259, line: 141)
!264 = !DISubprogram(name: "btowc", scope: !265, file: !265, line: 318, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!266 = !DISubroutineType(types: !267)
!267 = !{!261, !66}
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !269, file: !259, line: 142)
!269 = !DISubprogram(name: "fgetwc", scope: !265, file: !265, line: 727, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!270 = !DISubroutineType(types: !271)
!271 = !{!261, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !274, line: 5, baseType: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !276, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !277, identifier: "_ZTS8_IO_FILE")
!276 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !293, !295, !296, !297, !299, !300, !301, !305, !308, !310, !312, !313, !314, !315, !316, !317}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !275, file: !276, line: 246, baseType: !66, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !275, file: !276, line: 251, baseType: !216, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !275, file: !276, line: 252, baseType: !216, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !275, file: !276, line: 253, baseType: !216, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !275, file: !276, line: 254, baseType: !216, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !275, file: !276, line: 255, baseType: !216, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !275, file: !276, line: 256, baseType: !216, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !275, file: !276, line: 257, baseType: !216, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !275, file: !276, line: 258, baseType: !216, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !275, file: !276, line: 260, baseType: !216, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !275, file: !276, line: 261, baseType: !216, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !275, file: !276, line: 262, baseType: !216, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !275, file: !276, line: 264, baseType: !291, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !276, line: 160, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !275, file: !276, line: 266, baseType: !294, size: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !275, file: !276, line: 268, baseType: !66, size: 32, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !275, file: !276, line: 272, baseType: !66, size: 32, offset: 928)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !275, file: !276, line: 274, baseType: !298, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !11, line: 140, baseType: !129)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !275, file: !276, line: 278, baseType: !155, size: 16, offset: 1024)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !275, file: !276, line: 279, baseType: !117, size: 8, offset: 1040)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !275, file: !276, line: 280, baseType: !302, size: 8, offset: 1048)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !275, file: !276, line: 284, baseType: !306, size: 64, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !276, line: 154, baseType: null)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !275, file: !276, line: 293, baseType: !309, size: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !11, line: 141, baseType: !129)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !275, file: !276, line: 301, baseType: !311, size: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !275, file: !276, line: 302, baseType: !311, size: 64, offset: 1280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !275, file: !276, line: 303, baseType: !311, size: 64, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !275, file: !276, line: 304, baseType: !311, size: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !275, file: !276, line: 306, baseType: !51, size: 64, offset: 1472)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !275, file: !276, line: 307, baseType: !66, size: 32, offset: 1536)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !275, file: !276, line: 309, baseType: !318, size: 160, offset: 1568)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 20)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !322, file: !259, line: 143)
!322 = !DISubprogram(name: "fgetws", scope: !265, file: !265, line: 756, type: !323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!323 = !DISubroutineType(types: !324)
!324 = !{!325, !327, !66, !328}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !325)
!328 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !272)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !330, file: !259, line: 144)
!330 = !DISubprogram(name: "fputwc", scope: !265, file: !265, line: 741, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!331 = !DISubroutineType(types: !332)
!332 = !{!261, !326, !272}
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !334, file: !259, line: 145)
!334 = !DISubprogram(name: "fputws", scope: !265, file: !265, line: 763, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!335 = !DISubroutineType(types: !336)
!336 = !{!66, !337, !328}
!337 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !341, file: !259, line: 146)
!341 = !DISubprogram(name: "fwide", scope: !265, file: !265, line: 573, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DISubroutineType(types: !343)
!343 = !{!66, !272, !66}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !345, file: !259, line: 147)
!345 = !DISubprogram(name: "fwprintf", scope: !265, file: !265, line: 580, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!346 = !DISubroutineType(types: !347)
!347 = !{!66, !328, !337, null}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !349, file: !259, line: 148)
!349 = !DISubprogram(name: "fwscanf", scope: !265, file: !265, line: 621, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !351, file: !259, line: 149)
!351 = !DISubprogram(name: "getwc", scope: !265, file: !265, line: 728, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !353, file: !259, line: 150)
!353 = !DISubprogram(name: "getwchar", scope: !265, file: !265, line: 734, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DISubroutineType(types: !355)
!355 = !{!261}
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !357, file: !259, line: 151)
!357 = !DISubprogram(name: "mbrlen", scope: !265, file: !265, line: 329, type: !358, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{!51, !236, !51, !360}
!360 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !363, file: !259, line: 152)
!363 = !DISubprogram(name: "mbrtowc", scope: !265, file: !265, line: 296, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!364 = !DISubroutineType(types: !365)
!365 = !{!51, !327, !236, !51, !360}
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !367, file: !259, line: 153)
!367 = !DISubprogram(name: "mbsinit", scope: !265, file: !265, line: 292, type: !368, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!368 = !DISubroutineType(types: !369)
!369 = !{!66, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !373, file: !259, line: 154)
!373 = !DISubprogram(name: "mbsrtowcs", scope: !265, file: !265, line: 337, type: !374, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!374 = !DISubroutineType(types: !375)
!375 = !{!51, !327, !376, !51, !360}
!376 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !379, file: !259, line: 155)
!379 = !DISubprogram(name: "putwc", scope: !265, file: !265, line: 742, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !381, file: !259, line: 156)
!381 = !DISubprogram(name: "putwchar", scope: !265, file: !265, line: 748, type: !382, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!382 = !DISubroutineType(types: !383)
!383 = !{!261, !326}
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !385, file: !259, line: 158)
!385 = !DISubprogram(name: "swprintf", scope: !265, file: !265, line: 590, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!386 = !DISubroutineType(types: !387)
!387 = !{!66, !327, !51, !337, null}
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !389, file: !259, line: 160)
!389 = !DISubprogram(name: "swscanf", scope: !265, file: !265, line: 631, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!390 = !DISubroutineType(types: !391)
!391 = !{!66, !337, !337, null}
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !393, file: !259, line: 161)
!393 = !DISubprogram(name: "ungetwc", scope: !265, file: !265, line: 771, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{!261, !261, !272}
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !397, file: !259, line: 162)
!397 = !DISubprogram(name: "vfwprintf", scope: !265, file: !265, line: 598, type: !398, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!398 = !DISubroutineType(types: !399)
!399 = !{!66, !328, !337, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !402, identifier: "_ZTS13__va_list_tag")
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !401, file: !5, baseType: !12, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !401, file: !5, baseType: !12, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !401, file: !5, baseType: !311, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !401, file: !5, baseType: !311, size: 64, offset: 128)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !408, file: !259, line: 164)
!408 = !DISubprogram(name: "vfwscanf", scope: !265, file: !265, line: 673, type: !398, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !410, file: !259, line: 167)
!410 = !DISubprogram(name: "vswprintf", scope: !265, file: !265, line: 611, type: !411, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!411 = !DISubroutineType(types: !412)
!412 = !{!66, !327, !51, !337, !400}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !414, file: !259, line: 170)
!414 = !DISubprogram(name: "vswscanf", scope: !265, file: !265, line: 685, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!415 = !DISubroutineType(types: !416)
!416 = !{!66, !337, !337, !400}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !418, file: !259, line: 172)
!418 = !DISubprogram(name: "vwprintf", scope: !265, file: !265, line: 606, type: !419, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(types: !420)
!420 = !{!66, !337, !400}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !422, file: !259, line: 174)
!422 = !DISubprogram(name: "vwscanf", scope: !265, file: !265, line: 681, type: !419, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !424, file: !259, line: 176)
!424 = !DISubprogram(name: "wcrtomb", scope: !265, file: !265, line: 301, type: !425, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!425 = !DISubroutineType(types: !426)
!426 = !{!51, !235, !326, !360}
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !428, file: !259, line: 177)
!428 = !DISubprogram(name: "wcscat", scope: !265, file: !265, line: 97, type: !429, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{!325, !327, !337}
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !432, file: !259, line: 178)
!432 = !DISubprogram(name: "wcscmp", scope: !265, file: !265, line: 106, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubroutineType(types: !434)
!434 = !{!66, !338, !338}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !436, file: !259, line: 179)
!436 = !DISubprogram(name: "wcscoll", scope: !265, file: !265, line: 131, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !438, file: !259, line: 180)
!438 = !DISubprogram(name: "wcscpy", scope: !265, file: !265, line: 87, type: !429, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !440, file: !259, line: 181)
!440 = !DISubprogram(name: "wcscspn", scope: !265, file: !265, line: 187, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!441 = !DISubroutineType(types: !442)
!442 = !{!51, !338, !338}
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !444, file: !259, line: 182)
!444 = !DISubprogram(name: "wcsftime", scope: !265, file: !265, line: 835, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!51, !327, !51, !337, !237}
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !448, file: !259, line: 183)
!448 = !DISubprogram(name: "wcslen", scope: !265, file: !265, line: 222, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!449 = !DISubroutineType(types: !450)
!450 = !{!51, !338}
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !452, file: !259, line: 184)
!452 = !DISubprogram(name: "wcsncat", scope: !265, file: !265, line: 101, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!453 = !DISubroutineType(types: !454)
!454 = !{!325, !327, !337, !51}
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !456, file: !259, line: 185)
!456 = !DISubprogram(name: "wcsncmp", scope: !265, file: !265, line: 109, type: !457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!457 = !DISubroutineType(types: !458)
!458 = !{!66, !338, !338, !51}
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !460, file: !259, line: 186)
!460 = !DISubprogram(name: "wcsncpy", scope: !265, file: !265, line: 92, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !462, file: !259, line: 187)
!462 = !DISubprogram(name: "wcsrtombs", scope: !265, file: !265, line: 343, type: !463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!463 = !DISubroutineType(types: !464)
!464 = !{!51, !235, !465, !51, !360}
!465 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !468, file: !259, line: 188)
!468 = !DISubprogram(name: "wcsspn", scope: !265, file: !265, line: 191, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !470, file: !259, line: 189)
!470 = !DISubprogram(name: "wcstod", scope: !265, file: !265, line: 377, type: !471, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DISubroutineType(types: !472)
!472 = !{!201, !337, !473}
!473 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !476, file: !259, line: 191)
!476 = !DISubprogram(name: "wcstof", scope: !265, file: !265, line: 382, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !337, !473}
!479 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !481, file: !259, line: 193)
!481 = !DISubprogram(name: "wcstok", scope: !265, file: !265, line: 217, type: !482, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!482 = !DISubroutineType(types: !483)
!483 = !{!325, !327, !337, !473}
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !485, file: !259, line: 194)
!485 = !DISubprogram(name: "wcstol", scope: !265, file: !265, line: 428, type: !486, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!486 = !DISubroutineType(types: !487)
!487 = !{!129, !337, !473, !66}
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !489, file: !259, line: 195)
!489 = !DISubprogram(name: "wcstoul", scope: !265, file: !265, line: 433, type: !490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!490 = !DISubroutineType(types: !491)
!491 = !{!41, !337, !473, !66}
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !493, file: !259, line: 196)
!493 = !DISubprogram(name: "wcsxfrm", scope: !265, file: !265, line: 135, type: !494, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DISubroutineType(types: !495)
!495 = !{!51, !327, !337, !51}
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !497, file: !259, line: 197)
!497 = !DISubprogram(name: "wctob", scope: !265, file: !265, line: 324, type: !498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DISubroutineType(types: !499)
!499 = !{!66, !261}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !501, file: !259, line: 198)
!501 = !DISubprogram(name: "wmemcmp", scope: !265, file: !265, line: 258, type: !457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !503, file: !259, line: 199)
!503 = !DISubprogram(name: "wmemcpy", scope: !265, file: !265, line: 262, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !505, file: !259, line: 200)
!505 = !DISubprogram(name: "wmemmove", scope: !265, file: !265, line: 267, type: !506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!506 = !DISubroutineType(types: !507)
!507 = !{!325, !325, !338, !51}
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !509, file: !259, line: 201)
!509 = !DISubprogram(name: "wmemset", scope: !265, file: !265, line: 271, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubroutineType(types: !511)
!511 = !{!325, !325, !326, !51}
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !513, file: !259, line: 202)
!513 = !DISubprogram(name: "wprintf", scope: !265, file: !265, line: 587, type: !514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!514 = !DISubroutineType(types: !515)
!515 = !{!66, !337, null}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !517, file: !259, line: 203)
!517 = !DISubprogram(name: "wscanf", scope: !265, file: !265, line: 628, type: !514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !519, file: !259, line: 204)
!519 = !DISubprogram(name: "wcschr", scope: !265, file: !265, line: 164, type: !520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{!325, !338, !326}
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !523, file: !259, line: 205)
!523 = !DISubprogram(name: "wcspbrk", scope: !265, file: !265, line: 201, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubroutineType(types: !525)
!525 = !{!325, !338, !338}
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !527, file: !259, line: 206)
!527 = !DISubprogram(name: "wcsrchr", scope: !265, file: !265, line: 174, type: !520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !529, file: !259, line: 207)
!529 = !DISubprogram(name: "wcsstr", scope: !265, file: !265, line: 212, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !531, file: !259, line: 208)
!531 = !DISubprogram(name: "wmemchr", scope: !265, file: !265, line: 253, type: !532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!532 = !DISubroutineType(types: !533)
!533 = !{!325, !338, !326, !51}
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !535, file: !259, line: 248)
!535 = !DISubprogram(name: "wcstold", scope: !265, file: !265, line: 384, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !337, !473}
!538 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !540, file: !259, line: 257)
!540 = !DISubprogram(name: "wcstoll", scope: !265, file: !265, line: 441, type: !541, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !337, !473, !66}
!543 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !545, file: !259, line: 258)
!545 = !DISubprogram(name: "wcstoull", scope: !265, file: !265, line: 448, type: !546, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !337, !473, !66}
!548 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !535, file: !259, line: 264)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !540, file: !259, line: 265)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !545, file: !259, line: 266)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !476, file: !259, line: 280)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !408, file: !259, line: 283)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !414, file: !259, line: 286)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !422, file: !259, line: 289)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !535, file: !259, line: 293)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !540, file: !259, line: 294)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !545, file: !259, line: 295)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !560, file: !561, line: 57)
!560 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !562, file: !561, line: 79, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !563, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!561 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/exception_ptr.h", directory: "")
!562 = !DINamespace(name: "__exception_ptr", scope: !108)
!563 = !{!564, !565, !569, !572, !573, !578, !579, !583, !589, !593, !597, !600, !601, !604, !607}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !560, file: !561, line: 81, baseType: !311, size: 64)
!565 = !DISubprogram(name: "exception_ptr", scope: !560, file: !561, line: 83, type: !566, scopeLine: 83, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !568, !311}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!569 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !560, file: !561, line: 85, type: !570, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !568}
!572 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !560, file: !561, line: 86, type: !570, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !560, file: !561, line: 88, type: !574, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!574 = !DISubroutineType(types: !575)
!575 = !{!311, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!578 = !DISubprogram(name: "exception_ptr", scope: !560, file: !561, line: 96, type: !570, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubprogram(name: "exception_ptr", scope: !560, file: !561, line: 98, type: !580, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !568, !582}
!582 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !577, size: 64)
!583 = !DISubprogram(name: "exception_ptr", scope: !560, file: !561, line: 101, type: !584, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !568, !586}
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !108, file: !587, line: 235, baseType: !588)
!587 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/x86_64-linux-gnu/c++/7.5.0/bits/c++config.h", directory: "")
!588 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!589 = !DISubprogram(name: "exception_ptr", scope: !560, file: !561, line: 105, type: !590, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !568, !592}
!592 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !560, size: 64)
!593 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !560, file: !561, line: 118, type: !594, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !568, !582}
!596 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !560, size: 64)
!597 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !560, file: !561, line: 122, type: !598, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!598 = !DISubroutineType(types: !599)
!599 = !{!596, !568, !592}
!600 = !DISubprogram(name: "~exception_ptr", scope: !560, file: !561, line: 129, type: !570, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!601 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !560, file: !561, line: 132, type: !602, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !568, !596}
!604 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !560, file: !561, line: 144, type: !605, scopeLine: 144, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!605 = !DISubroutineType(types: !606)
!606 = !{!90, !576}
!607 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !560, file: !561, line: 153, type: !608, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !576}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !108, file: !613, line: 88, size: 128, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt9type_info")
!613 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/typeinfo", directory: "")
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !562, entity: !615, file: !561, line: 73)
!615 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !108, file: !561, line: 69, type: !616, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !560}
!618 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !619, entity: !620, file: !621, line: 58)
!619 = !DINamespace(name: "__gnu_debug", scope: null)
!620 = !DINamespace(name: "__debug", scope: !108)
!621 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/debug/debug.h", directory: "")
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !623, file: !624, line: 44)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !108, file: !587, line: 231, baseType: !41)
!624 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/new_allocator.h", directory: "")
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !626, file: !624, line: 45)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !108, file: !587, line: 232, baseType: !129)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !628, file: !630, line: 53)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !629, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!629 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!630 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/clocale", directory: "")
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !632, file: !630, line: 54)
!632 = !DISubprogram(name: "setlocale", scope: !629, file: !629, line: 122, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!633 = !DISubroutineType(types: !634)
!634 = !{!216, !66, !42}
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !636, file: !630, line: 55)
!636 = !DISubprogram(name: "localeconv", scope: !629, file: !629, line: 125, type: !637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!637 = !DISubroutineType(types: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !641, file: !645, line: 64)
!641 = !DISubprogram(name: "isalnum", scope: !642, file: !642, line: 108, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!642 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!643 = !DISubroutineType(types: !644)
!644 = !{!66, !66}
!645 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cctype", directory: "")
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !647, file: !645, line: 65)
!647 = !DISubprogram(name: "isalpha", scope: !642, file: !642, line: 109, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !649, file: !645, line: 66)
!649 = !DISubprogram(name: "iscntrl", scope: !642, file: !642, line: 110, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !651, file: !645, line: 67)
!651 = !DISubprogram(name: "isdigit", scope: !642, file: !642, line: 111, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !653, file: !645, line: 68)
!653 = !DISubprogram(name: "isgraph", scope: !642, file: !642, line: 113, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !655, file: !645, line: 69)
!655 = !DISubprogram(name: "islower", scope: !642, file: !642, line: 112, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !657, file: !645, line: 70)
!657 = !DISubprogram(name: "isprint", scope: !642, file: !642, line: 114, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !659, file: !645, line: 71)
!659 = !DISubprogram(name: "ispunct", scope: !642, file: !642, line: 115, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !661, file: !645, line: 72)
!661 = !DISubprogram(name: "isspace", scope: !642, file: !642, line: 116, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !663, file: !645, line: 73)
!663 = !DISubprogram(name: "isupper", scope: !642, file: !642, line: 117, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !665, file: !645, line: 74)
!665 = !DISubprogram(name: "isxdigit", scope: !642, file: !642, line: 118, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !667, file: !645, line: 75)
!667 = !DISubprogram(name: "tolower", scope: !642, file: !642, line: 122, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !669, file: !645, line: 76)
!669 = !DISubprogram(name: "toupper", scope: !642, file: !642, line: 125, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !671, file: !645, line: 87)
!671 = !DISubprogram(name: "isblank", scope: !642, file: !642, line: 130, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !673, file: !675, line: 52)
!673 = !DISubprogram(name: "abs", scope: !674, file: !674, line: 837, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!674 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!675 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/std_abs.h", directory: "")
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !677, file: !679, line: 127)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !674, line: 62, baseType: !678)
!678 = !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!679 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstdlib", directory: "")
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !681, file: !679, line: 128)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !674, line: 70, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !683, identifier: "_ZTS6ldiv_t")
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !682, file: !674, line: 68, baseType: !129, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !682, file: !674, line: 69, baseType: !129, size: 64, offset: 64)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !687, file: !679, line: 130)
!687 = !DISubprogram(name: "abort", scope: !674, file: !674, line: 588, type: !688, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!688 = !DISubroutineType(types: !689)
!689 = !{null}
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !691, file: !679, line: 134)
!691 = !DISubprogram(name: "atexit", scope: !674, file: !674, line: 592, type: !692, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!692 = !DISubroutineType(types: !693)
!693 = !{!66, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !696, file: !679, line: 137)
!696 = !DISubprogram(name: "at_quick_exit", scope: !674, file: !674, line: 597, type: !692, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !698, file: !679, line: 140)
!698 = !DISubprogram(name: "atof", scope: !699, file: !699, line: 25, type: !700, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!699 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!700 = !DISubroutineType(types: !701)
!701 = !{!201, !42}
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !703, file: !679, line: 141)
!703 = !DISubprogram(name: "atoi", scope: !674, file: !674, line: 361, type: !704, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!704 = !DISubroutineType(types: !705)
!705 = !{!66, !42}
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !707, file: !679, line: 142)
!707 = !DISubprogram(name: "atol", scope: !674, file: !674, line: 366, type: !708, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!708 = !DISubroutineType(types: !709)
!709 = !{!129, !42}
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !711, file: !679, line: 143)
!711 = !DISubprogram(name: "bsearch", scope: !712, file: !712, line: 20, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!713 = !DISubroutineType(types: !714)
!714 = !{!311, !715, !715, !51, !51, !717}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !674, line: 805, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!66, !715, !715}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !722, file: !679, line: 144)
!722 = !DISubprogram(name: "calloc", scope: !674, file: !674, line: 541, type: !723, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!723 = !DISubroutineType(types: !724)
!724 = !{!311, !51, !51}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !726, file: !679, line: 145)
!726 = !DISubprogram(name: "div", scope: !674, file: !674, line: 849, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!727 = !DISubroutineType(types: !728)
!728 = !{!677, !66, !66}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !730, file: !679, line: 146)
!730 = !DISubprogram(name: "exit", scope: !674, file: !674, line: 614, type: !731, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !66}
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !734, file: !679, line: 147)
!734 = !DISubprogram(name: "free", scope: !674, file: !674, line: 563, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !311}
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !738, file: !679, line: 148)
!738 = !DISubprogram(name: "getenv", scope: !674, file: !674, line: 631, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DISubroutineType(types: !740)
!740 = !{!216, !42}
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !742, file: !679, line: 149)
!742 = !DISubprogram(name: "labs", scope: !674, file: !674, line: 838, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!743 = !DISubroutineType(types: !744)
!744 = !{!129, !129}
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !746, file: !679, line: 150)
!746 = !DISubprogram(name: "ldiv", scope: !674, file: !674, line: 851, type: !747, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DISubroutineType(types: !748)
!748 = !{!681, !129, !129}
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !750, file: !679, line: 151)
!750 = !DISubprogram(name: "malloc", scope: !674, file: !674, line: 539, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DISubroutineType(types: !752)
!752 = !{!311, !51}
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !754, file: !679, line: 153)
!754 = !DISubprogram(name: "mblen", scope: !674, file: !674, line: 919, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!755 = !DISubroutineType(types: !756)
!756 = !{!66, !42, !51}
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !758, file: !679, line: 154)
!758 = !DISubprogram(name: "mbstowcs", scope: !674, file: !674, line: 930, type: !759, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!759 = !DISubroutineType(types: !760)
!760 = !{!51, !327, !236, !51}
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !762, file: !679, line: 155)
!762 = !DISubprogram(name: "mbtowc", scope: !674, file: !674, line: 922, type: !763, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!763 = !DISubroutineType(types: !764)
!764 = !{!66, !327, !236, !51}
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !766, file: !679, line: 157)
!766 = !DISubprogram(name: "qsort", scope: !674, file: !674, line: 827, type: !767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !311, !51, !51, !717}
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !770, file: !679, line: 160)
!770 = !DISubprogram(name: "quick_exit", scope: !674, file: !674, line: 620, type: !731, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !772, file: !679, line: 163)
!772 = !DISubprogram(name: "rand", scope: !674, file: !674, line: 453, type: !773, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!773 = !DISubroutineType(types: !774)
!774 = !{!66}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !776, file: !679, line: 164)
!776 = !DISubprogram(name: "realloc", scope: !674, file: !674, line: 549, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!777 = !DISubroutineType(types: !778)
!778 = !{!311, !311, !51}
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !780, file: !679, line: 165)
!780 = !DISubprogram(name: "srand", scope: !674, file: !674, line: 455, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !12}
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !784, file: !679, line: 166)
!784 = !DISubprogram(name: "strtod", scope: !674, file: !674, line: 117, type: !785, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{!201, !236, !787}
!787 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !790, file: !679, line: 167)
!790 = !DISubprogram(name: "strtol", scope: !674, file: !674, line: 176, type: !791, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!791 = !DISubroutineType(types: !792)
!792 = !{!129, !236, !787, !66}
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !794, file: !679, line: 168)
!794 = !DISubprogram(name: "strtoul", scope: !674, file: !674, line: 180, type: !795, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!795 = !DISubroutineType(types: !796)
!796 = !{!41, !236, !787, !66}
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !798, file: !679, line: 169)
!798 = !DISubprogram(name: "system", scope: !674, file: !674, line: 781, type: !704, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !800, file: !679, line: 171)
!800 = !DISubprogram(name: "wcstombs", scope: !674, file: !674, line: 933, type: !801, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DISubroutineType(types: !802)
!802 = !{!51, !235, !337, !51}
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !804, file: !679, line: 172)
!804 = !DISubprogram(name: "wctomb", scope: !674, file: !674, line: 926, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DISubroutineType(types: !806)
!806 = !{!66, !216, !326}
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !808, file: !679, line: 200)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !674, line: 80, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !810, identifier: "_ZTS7lldiv_t")
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !809, file: !674, line: 78, baseType: !543, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !809, file: !674, line: 79, baseType: !543, size: 64, offset: 64)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !814, file: !679, line: 206)
!814 = !DISubprogram(name: "_Exit", scope: !674, file: !674, line: 626, type: !731, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !816, file: !679, line: 210)
!816 = !DISubprogram(name: "llabs", scope: !674, file: !674, line: 841, type: !817, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!817 = !DISubroutineType(types: !818)
!818 = !{!543, !543}
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !820, file: !679, line: 216)
!820 = !DISubprogram(name: "lldiv", scope: !674, file: !674, line: 855, type: !821, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!821 = !DISubroutineType(types: !822)
!822 = !{!808, !543, !543}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !824, file: !679, line: 227)
!824 = !DISubprogram(name: "atoll", scope: !674, file: !674, line: 373, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(types: !826)
!826 = !{!543, !42}
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !828, file: !679, line: 228)
!828 = !DISubprogram(name: "strtoll", scope: !674, file: !674, line: 200, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!829 = !DISubroutineType(types: !830)
!830 = !{!543, !236, !787, !66}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !832, file: !679, line: 229)
!832 = !DISubprogram(name: "strtoull", scope: !674, file: !674, line: 205, type: !833, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!548, !236, !787, !66}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !836, file: !679, line: 231)
!836 = !DISubprogram(name: "strtof", scope: !674, file: !674, line: 123, type: !837, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubroutineType(types: !838)
!838 = !{!479, !236, !787}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !27, entity: !840, file: !679, line: 232)
!840 = !DISubprogram(name: "strtold", scope: !674, file: !674, line: 126, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DISubroutineType(types: !842)
!842 = !{!538, !236, !787}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !808, file: !679, line: 240)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !814, file: !679, line: 242)
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !816, file: !679, line: 244)
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !847, file: !679, line: 245)
!847 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !27, file: !679, line: 213, type: !821, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !820, file: !679, line: 246)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !824, file: !679, line: 248)
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !836, file: !679, line: 249)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !828, file: !679, line: 250)
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !832, file: !679, line: 251)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !840, file: !679, line: 252)
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !108, entity: !855, file: !857, line: 98)
