; ModuleID = 'util/hash.cc'
source_filename = "util/hash.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

; Function Attrs: norecurse nounwind readonly uwtable willreturn mustprogress
define i32 @_ZN7leveldb4HashEPKcmj(i8* %0, i64 %1, i32 %2) local_unnamed_addr #0 !dbg !1034 {
  call void @llvm.dbg.value(metadata i8* %0, metadata !1039, metadata !DIExpression()), !dbg !1049
  call void @llvm.dbg.value(metadata i64 %1, metadata !1040, metadata !DIExpression()), !dbg !1049
  call void @llvm.dbg.value(metadata i32 %2, metadata !1041, metadata !DIExpression()), !dbg !1049
  call void @llvm.dbg.value(metadata i32 -962287725, metadata !1042, metadata !DIExpression()), !dbg !1049
  call void @llvm.dbg.value(metadata i32 24, metadata !1044, metadata !DIExpression()), !dbg !1049
  %4 = getelementptr inbounds i8, i8* %0, i64 %1, !dbg !1050
  call void @llvm.dbg.value(metadata i8* %4, metadata !1045, metadata !DIExpression()), !dbg !1049
  %5 = trunc i64 %1 to i32, !dbg !1051
  %6 = mul i32 %5, -962287725, !dbg !1051
  %7 = xor i32 %6, %2, !dbg !1051
  call void @llvm.dbg.value(metadata i32 %7, metadata !1046, metadata !DIExpression()), !dbg !1049
  call void @llvm.dbg.value(metadata i8* %0, metadata !1039, metadata !DIExpression()), !dbg !1049
  %8 = icmp slt i64 %1, 4, !dbg !1052
  br i1 %8, label %38, label %9, !dbg !1053

9:                                                ; preds = %3

!133 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !132)
!135 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!138 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !139, file: !109, line: 81)
!139 = !DISubprogram(name: "strcmp", scope: !101, file: !101, line: 136, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!140 = !DISubroutineType(types: !141)
!141 = !{!41, !136, !136}
!142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !143, file: !109, line: 82)
!143 = !DISubprogram(name: "strcoll", scope: !101, file: !101, line: 143, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!144 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !145, file: !109, line: 83)
!145 = !DISubprogram(name: "strcpy", scope: !101, file: !101, line: 121, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !147, file: !109, line: 84)
!147 = !DISubprogram(name: "strcspn", scope: !101, file: !101, line: 272, type: !148, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!148 = !DISubroutineType(types: !149)
!149 = !{!107, !136, !136}
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !151, file: !109, line: 85)
!151 = !DISubprogram(name: "strerror", scope: !101, file: !101, line: 396, type: !152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!152 = !DISubroutineType(types: !153)
!153 = !{!132, !41}
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !155, file: !109, line: 86)
!155 = !DISubprogram(name: "strlen", scope: !101, file: !101, line: 384, type: !156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!156 = !DISubroutineType(types: !157)
!157 = !{!107, !136}
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !159, file: !109, line: 87)
!159 = !DISubprogram(name: "strncat", scope: !101, file: !101, line: 132, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DISubroutineType(types: !161)
!161 = !{!132, !134, !135, !107}
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !163, file: !109, line: 88)
!163 = !DISubprogram(name: "strncmp", scope: !101, file: !101, line: 139, type: !164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!164 = !DISubroutineType(types: !165)
!165 = !{!41, !136, !136, !107}
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !167, file: !109, line: 89)
!167 = !DISubprogram(name: "strncpy", scope: !101, file: !101, line: 124, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !169, file: !109, line: 90)
!169 = !DISubprogram(name: "strspn", scope: !101, file: !101, line: 276, type: !148, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !171, file: !109, line: 91)
!171 = !DISubprogram(name: "strtok", scope: !101, file: !101, line: 335, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !173, file: !109, line: 92)
!173 = !DISubprogram(name: "strxfrm", scope: !101, file: !101, line: 146, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !134, !135, !107}
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !177, file: !109, line: 93)
!177 = !DISubprogram(name: "strchr", scope: !101, file: !101, line: 225, type: !178, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{!132, !136, !41}
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !181, file: !109, line: 94)
!181 = !DISubprogram(name: "strpbrk", scope: !101, file: !101, line: 302, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!182 = !DISubroutineType(types: !183)
!183 = !{!132, !136, !136}
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !185, file: !109, line: 95)
!185 = !DISubprogram(name: "strrchr", scope: !101, file: !101, line: 252, type: !178, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !187, file: !109, line: 96)
!187 = !DISubprogram(name: "strstr", scope: !101, file: !101, line: 329, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !189, entity: !190, file: !191, line: 58)
!189 = !DINamespace(name: "__gnu_debug", scope: null)
!190 = !DINamespace(name: "__debug", scope: !23)
!191 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/debug/debug.h", directory: "")
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !193, file: !208, line: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !194, line: 6, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !196, line: 21, baseType: !197)
!196 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !198, identifier: "_ZTS11__mbstate_t")
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !197, file: !196, line: 15, baseType: !41, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !197, file: !196, line: 20, baseType: !201, size: 32, offset: 32)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !197, file: !196, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !202, identifier: "_ZTSN11__mbstate_tUt_E")
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !201, file: !196, line: 18, baseType: !6, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !201, file: !196, line: 19, baseType: !205, size: 32)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 32, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 4)
!208 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cwchar", directory: "")
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !210, file: !208, line: 139)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !211, line: 20, baseType: !6)
!211 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !213, file: !208, line: 141)
!213 = !DISubprogram(name: "btowc", scope: !214, file: !214, line: 318, type: !215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!214 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!215 = !DISubroutineType(types: !216)
!216 = !{!210, !41}
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !218, file: !208, line: 142)
!218 = !DISubprogram(name: "fgetwc", scope: !214, file: !214, line: 727, type: !219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!219 = !DISubroutineType(types: !220)
!220 = !{!210, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !223, line: 5, baseType: !224)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !225, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !226, identifier: "_ZTS8_IO_FILE")
!225 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !242, !244, !245, !246, !248, !249, !250, !254, !257, !259, !260, !261, !262, !263, !264, !265}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !224, file: !225, line: 246, baseType: !41, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !224, file: !225, line: 251, baseType: !132, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !224, file: !225, line: 252, baseType: !132, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !224, file: !225, line: 253, baseType: !132, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !224, file: !225, line: 254, baseType: !132, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !224, file: !225, line: 255, baseType: !132, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !224, file: !225, line: 256, baseType: !132, size: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !224, file: !225, line: 257, baseType: !132, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !224, file: !225, line: 258, baseType: !132, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !224, file: !225, line: 260, baseType: !132, size: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !224, file: !225, line: 261, baseType: !132, size: 64, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !224, file: !225, line: 262, baseType: !132, size: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !224, file: !225, line: 264, baseType: !240, size: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !225, line: 160, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !224, file: !225, line: 266, baseType: !243, size: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !224, file: !225, line: 268, baseType: !41, size: 32, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !224, file: !225, line: 272, baseType: !41, size: 32, offset: 928)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !224, file: !225, line: 274, baseType: !247, size: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !45)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !224, file: !225, line: 278, baseType: !72, size: 16, offset: 1024)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !224, file: !225, line: 279, baseType: !32, size: 8, offset: 1040)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !224, file: !225, line: 280, baseType: !251, size: 8, offset: 1048)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 1)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !224, file: !225, line: 284, baseType: !255, size: 64, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !225, line: 154, baseType: null)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !224, file: !225, line: 293, baseType: !258, size: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !45)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !224, file: !225, line: 301, baseType: !104, size: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !224, file: !225, line: 302, baseType: !104, size: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !224, file: !225, line: 303, baseType: !104, size: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !224, file: !225, line: 304, baseType: !104, size: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !224, file: !225, line: 306, baseType: !107, size: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !224, file: !225, line: 307, baseType: !41, size: 32, offset: 1536)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !224, file: !225, line: 309, baseType: !266, size: 160, offset: 1568)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 160, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 20)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !270, file: !208, line: 143)
!270 = !DISubprogram(name: "fgetws", scope: !214, file: !214, line: 756, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !275, !41, !276}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !273)
!276 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !221)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !278, file: !208, line: 144)
!278 = !DISubprogram(name: "fputwc", scope: !214, file: !214, line: 741, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!279 = !DISubroutineType(types: !280)
!280 = !{!210, !274, !221}
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !282, file: !208, line: 145)
!282 = !DISubprogram(name: "fputws", scope: !214, file: !214, line: 763, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{!41, !285, !276}
!285 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !289, file: !208, line: 146)
!289 = !DISubprogram(name: "fwide", scope: !214, file: !214, line: 573, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!290 = !DISubroutineType(types: !291)
!291 = !{!41, !221, !41}
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !293, file: !208, line: 147)
!293 = !DISubprogram(name: "fwprintf", scope: !214, file: !214, line: 580, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{!41, !276, !285, null}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !297, file: !208, line: 148)
!297 = !DISubprogram(name: "fwscanf", scope: !214, file: !214, line: 621, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !299, file: !208, line: 149)
!299 = !DISubprogram(name: "getwc", scope: !214, file: !214, line: 728, type: !219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !301, file: !208, line: 150)
!301 = !DISubprogram(name: "getwchar", scope: !214, file: !214, line: 734, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{!210}
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !305, file: !208, line: 151)
!305 = !DISubprogram(name: "mbrlen", scope: !214, file: !214, line: 329, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!107, !135, !107, !308}
!308 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !311, file: !208, line: 152)
!311 = !DISubprogram(name: "mbrtowc", scope: !214, file: !214, line: 296, type: !312, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!312 = !DISubroutineType(types: !313)
!313 = !{!107, !275, !135, !107, !308}
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !315, file: !208, line: 153)
!315 = !DISubprogram(name: "mbsinit", scope: !214, file: !214, line: 292, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{!41, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !321, file: !208, line: 154)
!321 = !DISubprogram(name: "mbsrtowcs", scope: !214, file: !214, line: 337, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubroutineType(types: !323)
!323 = !{!107, !275, !324, !107, !308}
!324 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !327, file: !208, line: 155)
!327 = !DISubprogram(name: "putwc", scope: !214, file: !214, line: 742, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !329, file: !208, line: 156)
!329 = !DISubprogram(name: "putwchar", scope: !214, file: !214, line: 748, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DISubroutineType(types: !331)
!331 = !{!210, !274}
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !333, file: !208, line: 158)
!333 = !DISubprogram(name: "swprintf", scope: !214, file: !214, line: 590, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{!41, !275, !107, !285, null}
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !337, file: !208, line: 160)
!337 = !DISubprogram(name: "swscanf", scope: !214, file: !214, line: 631, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DISubroutineType(types: !339)
!339 = !{!41, !285, !285, null}
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !341, file: !208, line: 161)
!341 = !DISubprogram(name: "ungetwc", scope: !214, file: !214, line: 771, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DISubroutineType(types: !343)
!343 = !{!210, !210, !221}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !345, file: !208, line: 162)
!345 = !DISubprogram(name: "vfwprintf", scope: !214, file: !214, line: 598, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!346 = !DISubroutineType(types: !347)
!347 = !{!41, !276, !285, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !350, identifier: "_ZTS13__va_list_tag")
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !349, file: !1, baseType: !6, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !349, file: !1, baseType: !6, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !349, file: !1, baseType: !104, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !349, file: !1, baseType: !104, size: 64, offset: 128)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !356, file: !208, line: 164)
!356 = !DISubprogram(name: "vfwscanf", scope: !214, file: !214, line: 673, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !358, file: !208, line: 167)
!358 = !DISubprogram(name: "vswprintf", scope: !214, file: !214, line: 611, type: !359, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!359 = !DISubroutineType(types: !360)
!360 = !{!41, !275, !107, !285, !348}
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !362, file: !208, line: 170)
!362 = !DISubprogram(name: "vswscanf", scope: !214, file: !214, line: 685, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DISubroutineType(types: !364)
!364 = !{!41, !285, !285, !348}
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !366, file: !208, line: 172)
!366 = !DISubprogram(name: "vwprintf", scope: !214, file: !214, line: 606, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!41, !285, !348}
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !370, file: !208, line: 174)
!370 = !DISubprogram(name: "vwscanf", scope: !214, file: !214, line: 681, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !372, file: !208, line: 176)
!372 = !DISubprogram(name: "wcrtomb", scope: !214, file: !214, line: 301, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DISubroutineType(types: !374)
!374 = !{!107, !134, !274, !308}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !376, file: !208, line: 177)
!376 = !DISubprogram(name: "wcscat", scope: !214, file: !214, line: 97, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!377 = !DISubroutineType(types: !378)
!378 = !{!273, !275, !285}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !380, file: !208, line: 178)
!380 = !DISubprogram(name: "wcscmp", scope: !214, file: !214, line: 106, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!381 = !DISubroutineType(types: !382)
!382 = !{!41, !286, !286}
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !384, file: !208, line: 179)
!384 = !DISubprogram(name: "wcscoll", scope: !214, file: !214, line: 131, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !386, file: !208, line: 180)
!386 = !DISubprogram(name: "wcscpy", scope: !214, file: !214, line: 87, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !388, file: !208, line: 181)
!388 = !DISubprogram(name: "wcscspn", scope: !214, file: !214, line: 187, type: !389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DISubroutineType(types: !390)
!390 = !{!107, !286, !286}
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !392, file: !208, line: 182)
!392 = !DISubprogram(name: "wcsftime", scope: !214, file: !214, line: 835, type: !393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!393 = !DISubroutineType(types: !394)
!394 = !{!107, !275, !107, !285, !395}
!395 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !214, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !400, file: !208, line: 183)
!400 = !DISubprogram(name: "wcslen", scope: !214, file: !214, line: 222, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!401 = !DISubroutineType(types: !402)
!402 = !{!107, !286}
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !404, file: !208, line: 184)
!404 = !DISubprogram(name: "wcsncat", scope: !214, file: !214, line: 101, type: !405, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!405 = !DISubroutineType(types: !406)
!406 = !{!273, !275, !285, !107}
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !408, file: !208, line: 185)
!408 = !DISubprogram(name: "wcsncmp", scope: !214, file: !214, line: 109, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!409 = !DISubroutineType(types: !410)
!410 = !{!41, !286, !286, !107}
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !412, file: !208, line: 186)
!412 = !DISubprogram(name: "wcsncpy", scope: !214, file: !214, line: 92, type: !405, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !414, file: !208, line: 187)
!414 = !DISubprogram(name: "wcsrtombs", scope: !214, file: !214, line: 343, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!415 = !DISubroutineType(types: !416)
!416 = !{!107, !134, !417, !107, !308}
!417 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !420, file: !208, line: 188)
!420 = !DISubprogram(name: "wcsspn", scope: !214, file: !214, line: 191, type: !389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !422, file: !208, line: 189)
!422 = !DISubprogram(name: "wcstod", scope: !214, file: !214, line: 377, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !285, !426}
!425 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!426 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !429, file: !208, line: 191)
!429 = !DISubprogram(name: "wcstof", scope: !214, file: !214, line: 382, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!430 = !DISubroutineType(types: !431)
!431 = !{!432, !285, !426}
!432 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !434, file: !208, line: 193)
!434 = !DISubprogram(name: "wcstok", scope: !214, file: !214, line: 217, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!435 = !DISubroutineType(types: !436)
!436 = !{!273, !275, !285, !426}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !438, file: !208, line: 194)
!438 = !DISubprogram(name: "wcstol", scope: !214, file: !214, line: 428, type: !439, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!439 = !DISubroutineType(types: !440)
!440 = !{!45, !285, !426, !41}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !442, file: !208, line: 195)
!442 = !DISubprogram(name: "wcstoul", scope: !214, file: !214, line: 433, type: !443, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!443 = !DISubroutineType(types: !444)
!444 = !{!77, !285, !426, !41}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !446, file: !208, line: 196)
!446 = !DISubprogram(name: "wcsxfrm", scope: !214, file: !214, line: 135, type: !447, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!447 = !DISubroutineType(types: !448)
!448 = !{!107, !275, !285, !107}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !450, file: !208, line: 197)
!450 = !DISubprogram(name: "wctob", scope: !214, file: !214, line: 324, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!41, !210}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !454, file: !208, line: 198)
!454 = !DISubprogram(name: "wmemcmp", scope: !214, file: !214, line: 258, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !456, file: !208, line: 199)
!456 = !DISubprogram(name: "wmemcpy", scope: !214, file: !214, line: 262, type: !405, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !458, file: !208, line: 200)
!458 = !DISubprogram(name: "wmemmove", scope: !214, file: !214, line: 267, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DISubroutineType(types: !460)
!460 = !{!273, !273, !286, !107}
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !462, file: !208, line: 201)
!462 = !DISubprogram(name: "wmemset", scope: !214, file: !214, line: 271, type: !463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!463 = !DISubroutineType(types: !464)
!464 = !{!273, !273, !274, !107}
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !466, file: !208, line: 202)
!466 = !DISubprogram(name: "wprintf", scope: !214, file: !214, line: 587, type: !467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DISubroutineType(types: !468)
!468 = !{!41, !285, null}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !470, file: !208, line: 203)
!470 = !DISubprogram(name: "wscanf", scope: !214, file: !214, line: 628, type: !467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !472, file: !208, line: 204)
!472 = !DISubprogram(name: "wcschr", scope: !214, file: !214, line: 164, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!473 = !DISubroutineType(types: !474)
!474 = !{!273, !286, !274}
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !476, file: !208, line: 205)
!476 = !DISubprogram(name: "wcspbrk", scope: !214, file: !214, line: 201, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!477 = !DISubroutineType(types: !478)
!478 = !{!273, !286, !286}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !480, file: !208, line: 206)
!480 = !DISubprogram(name: "wcsrchr", scope: !214, file: !214, line: 174, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !482, file: !208, line: 207)
!482 = !DISubprogram(name: "wcsstr", scope: !214, file: !214, line: 212, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !484, file: !208, line: 208)
!484 = !DISubprogram(name: "wmemchr", scope: !214, file: !214, line: 253, type: !485, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DISubroutineType(types: !486)
!486 = !{!273, !286, !274, !107}
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !488, file: !208, line: 248)
!488 = !DISubprogram(name: "wcstold", scope: !214, file: !214, line: 384, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!489 = !DISubroutineType(types: !490)
!490 = !{!491, !285, !426}
!491 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !493, file: !208, line: 257)
!493 = !DISubprogram(name: "wcstoll", scope: !214, file: !214, line: 441, type: !494, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !285, !426, !41}
!496 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !498, file: !208, line: 258)
!498 = !DISubprogram(name: "wcstoull", scope: !214, file: !214, line: 448, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !285, !426, !41}
!501 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !488, file: !208, line: 264)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !493, file: !208, line: 265)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !498, file: !208, line: 266)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !429, file: !208, line: 280)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !356, file: !208, line: 283)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !362, file: !208, line: 286)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !370, file: !208, line: 289)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !488, file: !208, line: 293)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !493, file: !208, line: 294)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !498, file: !208, line: 295)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !513, file: !514, line: 57)
!513 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !515, file: !514, line: 79, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !516, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!514 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/exception_ptr.h", directory: "")
!515 = !DINamespace(name: "__exception_ptr", scope: !23)
!516 = !{!517, !518, !522, !525, !526, !531, !532, !536, !542, !546, !550, !553, !554, !557, !561}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !513, file: !514, line: 81, baseType: !104, size: 64)
!518 = !DISubprogram(name: "exception_ptr", scope: !513, file: !514, line: 83, type: !519, scopeLine: 83, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521, !104}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!522 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !513, file: !514, line: 85, type: !523, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !521}
!525 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !513, file: !514, line: 86, type: !523, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!526 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !513, file: !514, line: 88, type: !527, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!527 = !DISubroutineType(types: !528)
!528 = !{!104, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!531 = !DISubprogram(name: "exception_ptr", scope: !513, file: !514, line: 96, type: !523, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!532 = !DISubprogram(name: "exception_ptr", scope: !513, file: !514, line: 98, type: !533, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !521, !535}
!535 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !530, size: 64)
!536 = !DISubprogram(name: "exception_ptr", scope: !513, file: !514, line: 101, type: !537, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !521, !539}
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !23, file: !540, line: 235, baseType: !541)
!540 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/x86_64-linux-gnu/c++/7.5.0/bits/c++config.h", directory: "")
!541 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!542 = !DISubprogram(name: "exception_ptr", scope: !513, file: !514, line: 105, type: !543, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !521, !545}
!545 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !513, size: 64)
!546 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !513, file: !514, line: 118, type: !547, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !521, !535}
!549 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !513, size: 64)
!550 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !513, file: !514, line: 122, type: !551, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubroutineType(types: !552)
!552 = !{!549, !521, !545}
!553 = !DISubprogram(name: "~exception_ptr", scope: !513, file: !514, line: 129, type: !523, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!554 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !513, file: !514, line: 132, type: !555, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !521, !549}
!557 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !513, file: !514, line: 144, type: !558, scopeLine: 144, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!558 = !DISubroutineType(types: !559)
!559 = !{!560, !529}
!560 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!561 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !513, file: !514, line: 153, type: !562, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!562 = !DISubroutineType(types: !563)
!563 = !{!564, !529}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !23, file: !567, line: 88, size: 128, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt9type_info")
!567 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/typeinfo", directory: "")
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !515, entity: !569, file: !514, line: 73)
!569 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !23, file: !514, line: 69, type: !570, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !513}
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !573, file: !574, line: 44)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !23, file: !540, line: 231, baseType: !77)
!574 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/new_allocator.h", directory: "")
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !576, file: !574, line: 45)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !23, file: !540, line: 232, baseType: !45)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !578, file: !580, line: 53)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !579, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!579 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!580 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/clocale", directory: "")
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !582, file: !580, line: 54)
!582 = !DISubprogram(name: "setlocale", scope: !579, file: !579, line: 122, type: !583, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubroutineType(types: !584)
!584 = !{!132, !41, !136}
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !586, file: !580, line: 55)
!586 = !DISubprogram(name: "localeconv", scope: !579, file: !579, line: 125, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!587 = !DISubroutineType(types: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !591, file: !595, line: 64)
!591 = !DISubprogram(name: "isalnum", scope: !592, file: !592, line: 108, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!592 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!593 = !DISubroutineType(types: !594)
!594 = !{!41, !41}
!595 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cctype", directory: "")
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !597, file: !595, line: 65)
!597 = !DISubprogram(name: "isalpha", scope: !592, file: !592, line: 109, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !599, file: !595, line: 66)
!599 = !DISubprogram(name: "iscntrl", scope: !592, file: !592, line: 110, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !601, file: !595, line: 67)
!601 = !DISubprogram(name: "isdigit", scope: !592, file: !592, line: 111, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !603, file: !595, line: 68)
!603 = !DISubprogram(name: "isgraph", scope: !592, file: !592, line: 113, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !605, file: !595, line: 69)
!605 = !DISubprogram(name: "islower", scope: !592, file: !592, line: 112, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !607, file: !595, line: 70)
!607 = !DISubprogram(name: "isprint", scope: !592, file: !592, line: 114, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !609, file: !595, line: 71)
!609 = !DISubprogram(name: "ispunct", scope: !592, file: !592, line: 115, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !611, file: !595, line: 72)
!611 = !DISubprogram(name: "isspace", scope: !592, file: !592, line: 116, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !613, file: !595, line: 73)
!613 = !DISubprogram(name: "isupper", scope: !592, file: !592, line: 117, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !615, file: !595, line: 74)
!615 = !DISubprogram(name: "isxdigit", scope: !592, file: !592, line: 118, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !617, file: !595, line: 75)
!617 = !DISubprogram(name: "tolower", scope: !592, file: !592, line: 122, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !619, file: !595, line: 76)
!619 = !DISubprogram(name: "toupper", scope: !592, file: !592, line: 125, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !621, file: !595, line: 87)
!621 = !DISubprogram(name: "isblank", scope: !592, file: !592, line: 130, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !623, file: !625, line: 52)
!623 = !DISubprogram(name: "abs", scope: !624, file: !624, line: 837, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!624 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!625 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/std_abs.h", directory: "")
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !627, file: !629, line: 127)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !624, line: 62, baseType: !628)
!628 = !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!629 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstdlib", directory: "")
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !631, file: !629, line: 128)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !624, line: 70, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !633, identifier: "_ZTS6ldiv_t")
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !632, file: !624, line: 68, baseType: !45, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !632, file: !624, line: 69, baseType: !45, size: 64, offset: 64)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !637, file: !629, line: 130)
!637 = !DISubprogram(name: "abort", scope: !624, file: !624, line: 588, type: !638, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!638 = !DISubroutineType(types: !639)
!639 = !{null}
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !641, file: !629, line: 134)
!641 = !DISubprogram(name: "atexit", scope: !624, file: !624, line: 592, type: !642, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!642 = !DISubroutineType(types: !643)
!643 = !{!41, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !646, file: !629, line: 137)
!646 = !DISubprogram(name: "at_quick_exit", scope: !624, file: !624, line: 597, type: !642, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !648, file: !629, line: 140)
!648 = !DISubprogram(name: "atof", scope: !649, file: !649, line: 25, type: !650, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!649 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!650 = !DISubroutineType(types: !651)
!651 = !{!425, !136}
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !653, file: !629, line: 141)
!653 = !DISubprogram(name: "atoi", scope: !624, file: !624, line: 361, type: !654, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!654 = !DISubroutineType(types: !655)
!655 = !{!41, !136}
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !657, file: !629, line: 142)
!657 = !DISubprogram(name: "atol", scope: !624, file: !624, line: 366, type: !658, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!658 = !DISubroutineType(types: !659)
!659 = !{!45, !136}
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !661, file: !629, line: 143)
!661 = !DISubprogram(name: "bsearch", scope: !662, file: !662, line: 20, type: !663, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!662 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!663 = !DISubroutineType(types: !664)
!664 = !{!104, !105, !105, !107, !107, !665}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !624, line: 805, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!41, !105, !105}
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !670, file: !629, line: 144)
!670 = !DISubprogram(name: "calloc", scope: !624, file: !624, line: 541, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!671 = !DISubroutineType(types: !672)
!672 = !{!104, !107, !107}
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !674, file: !629, line: 145)
!674 = !DISubprogram(name: "div", scope: !624, file: !624, line: 849, type: !675, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!675 = !DISubroutineType(types: !676)
!676 = !{!627, !41, !41}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !678, file: !629, line: 146)
!678 = !DISubprogram(name: "exit", scope: !624, file: !624, line: 614, type: !679, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !41}
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !682, file: !629, line: 147)
!682 = !DISubprogram(name: "free", scope: !624, file: !624, line: 563, type: !683, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !104}
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !686, file: !629, line: 148)
!686 = !DISubprogram(name: "getenv", scope: !624, file: !624, line: 631, type: !687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!687 = !DISubroutineType(types: !688)
!688 = !{!132, !136}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !690, file: !629, line: 149)
!690 = !DISubprogram(name: "labs", scope: !624, file: !624, line: 838, type: !691, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!691 = !DISubroutineType(types: !692)
!692 = !{!45, !45}
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !694, file: !629, line: 150)
!694 = !DISubprogram(name: "ldiv", scope: !624, file: !624, line: 851, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!695 = !DISubroutineType(types: !696)
!696 = !{!631, !45, !45}
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !698, file: !629, line: 151)
!698 = !DISubprogram(name: "malloc", scope: !624, file: !624, line: 539, type: !699, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!699 = !DISubroutineType(types: !700)
!700 = !{!104, !107}
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !702, file: !629, line: 153)
!702 = !DISubprogram(name: "mblen", scope: !624, file: !624, line: 919, type: !703, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!703 = !DISubroutineType(types: !704)
!704 = !{!41, !136, !107}
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !706, file: !629, line: 154)
!706 = !DISubprogram(name: "mbstowcs", scope: !624, file: !624, line: 930, type: !707, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!707 = !DISubroutineType(types: !708)
!708 = !{!107, !275, !135, !107}
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !710, file: !629, line: 155)
!710 = !DISubprogram(name: "mbtowc", scope: !624, file: !624, line: 922, type: !711, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!711 = !DISubroutineType(types: !712)
!712 = !{!41, !275, !135, !107}
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !714, file: !629, line: 157)
!714 = !DISubprogram(name: "qsort", scope: !624, file: !624, line: 827, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !104, !107, !107, !665}
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !718, file: !629, line: 160)
!718 = !DISubprogram(name: "quick_exit", scope: !624, file: !624, line: 620, type: !679, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !720, file: !629, line: 163)
!720 = !DISubprogram(name: "rand", scope: !624, file: !624, line: 453, type: !721, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!721 = !DISubroutineType(types: !722)
!722 = !{!41}
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !724, file: !629, line: 164)
!724 = !DISubprogram(name: "realloc", scope: !624, file: !624, line: 549, type: !725, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!725 = !DISubroutineType(types: !726)
!726 = !{!104, !104, !107}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !728, file: !629, line: 165)
!728 = !DISubprogram(name: "srand", scope: !624, file: !624, line: 455, type: !729, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !6}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !732, file: !629, line: 166)
!732 = !DISubprogram(name: "strtod", scope: !624, file: !624, line: 117, type: !733, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DISubroutineType(types: !734)
!734 = !{!425, !135, !735}
!735 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !738, file: !629, line: 167)
!738 = !DISubprogram(name: "strtol", scope: !624, file: !624, line: 176, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DISubroutineType(types: !740)
!740 = !{!45, !135, !735, !41}
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !742, file: !629, line: 168)
!742 = !DISubprogram(name: "strtoul", scope: !624, file: !624, line: 180, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!743 = !DISubroutineType(types: !744)
!744 = !{!77, !135, !735, !41}
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !746, file: !629, line: 169)
!746 = !DISubprogram(name: "system", scope: !624, file: !624, line: 781, type: !654, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !748, file: !629, line: 171)
!748 = !DISubprogram(name: "wcstombs", scope: !624, file: !624, line: 933, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DISubroutineType(types: !750)
!750 = !{!107, !134, !285, !107}
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !752, file: !629, line: 172)
!752 = !DISubprogram(name: "wctomb", scope: !624, file: !624, line: 926, type: !753, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!753 = !DISubroutineType(types: !754)
!754 = !{!41, !132, !274}
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !756, file: !629, line: 200)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !624, line: 80, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !624, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !758, identifier: "_ZTS7lldiv_t")
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !757, file: !624, line: 78, baseType: !496, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !757, file: !624, line: 79, baseType: !496, size: 64, offset: 64)
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !762, file: !629, line: 206)
!762 = !DISubprogram(name: "_Exit", scope: !624, file: !624, line: 626, type: !679, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !764, file: !629, line: 210)
!764 = !DISubprogram(name: "llabs", scope: !624, file: !624, line: 841, type: !765, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DISubroutineType(types: !766)
!766 = !{!496, !496}
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !768, file: !629, line: 216)
!768 = !DISubprogram(name: "lldiv", scope: !624, file: !624, line: 855, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!769 = !DISubroutineType(types: !770)
!770 = !{!756, !496, !496}
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !772, file: !629, line: 227)
!772 = !DISubprogram(name: "atoll", scope: !624, file: !624, line: 373, type: !773, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!773 = !DISubroutineType(types: !774)
!774 = !{!496, !136}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !776, file: !629, line: 228)
!776 = !DISubprogram(name: "strtoll", scope: !624, file: !624, line: 200, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!777 = !DISubroutineType(types: !778)
!778 = !{!496, !135, !735, !41}
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !780, file: !629, line: 229)
!780 = !DISubprogram(name: "strtoull", scope: !624, file: !624, line: 205, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!781 = !DISubroutineType(types: !782)
!782 = !{!501, !135, !735, !41}
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !784, file: !629, line: 231)
!784 = !DISubprogram(name: "strtof", scope: !624, file: !624, line: 123, type: !785, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{!432, !135, !735}
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !788, file: !629, line: 232)
!788 = !DISubprogram(name: "strtold", scope: !624, file: !624, line: 126, type: !789, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!491, !135, !735}
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !756, file: !629, line: 240)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !762, file: !629, line: 242)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !764, file: !629, line: 244)
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !795, file: !629, line: 245)
!795 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !5, file: !629, line: 213, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !768, file: !629, line: 246)
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !772, file: !629, line: 248)
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !784, file: !629, line: 249)
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !776, file: !629, line: 250)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !780, file: !629, line: 251)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !788, file: !629, line: 252)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !23, entity: !803, file: !805, line: 98)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !804, line: 7, baseType: !224)
