; ModuleID = 'table/table.cc'
source_filename = "table/table.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"class.leveldb::Table" = type { %"struct.leveldb::Table::Rep"* }
%"struct.leveldb::Table::Rep" = type { %"struct.leveldb::Options", %"class.leveldb::Status", %"class.leveldb::RandomAccessFile"*, i64, %"class.leveldb::FilterBlockReader"*, i8*, %"class.leveldb::BlockHandle", %"class.leveldb::Block"* }
%"struct.leveldb::Options" = type { %"class.leveldb::Comparator"*, i8, i8, i8, %"class.leveldb::Env"*, %"class.leveldb::Logger"*, i64, i32, %"class.leveldb::Cache"*, i64, i32, i64, i32, i32, i8, %"class.leveldb::FilterPolicy"* }
%"class.leveldb::Comparator" = type { i32 (...)** }
%"class.leveldb::Env" = type { i32 (...)** }
%"class.leveldb::Logger" = type { i32 (...)** }
%"class.leveldb::Cache" = type { i32 (...)** }
%"class.leveldb::FilterPolicy" = type { i32 (...)** }
%"class.leveldb::Status" = type { i8* }
%"class.leveldb::RandomAccessFile" = type { i32 (...)** }
%"class.leveldb::FilterBlockReader" = type { %"class.leveldb::FilterPolicy"*, i8*, i8*, i64, i64 }
%"class.leveldb::BlockHandle" = type { i64, i64 }
%"class.leveldb::Block" = type <{ i8*, i64, i32, i8, [3 x i8] }>
%"class.leveldb::Slice" = type { i8*, i64 }
%"class.leveldb::Footer" = type { %"class.leveldb::BlockHandle", %"class.leveldb::BlockHandle" }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !214, imports: !509, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "table/table.cc", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!2 = !{!3, !11, !18, !151, !210}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Lock_policy", scope: !5, file: !4, line: 49, baseType: !6, size: 32, elements: !7, identifier: "_ZTSN9__gnu_cxx12_Lock_policyE")
!4 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/concurrence.h", directory: "")
!5 = !DINamespace(name: "__gnu_cxx", scope: null)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "_S_single", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "_S_mutex", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "_S_atomic", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CompressionType", scope: !13, file: !12, line: 25, baseType: !6, size: 32, elements: !14, identifier: "_ZTSN7leveldb15CompressionTypeE")
!12 = !DIFile(filename: "./include/leveldb/options.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!13 = !DINamespace(name: "leveldb", scope: null)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "kNoCompression", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "kSnappyCompression", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "kZstdCompression", value: 2, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Code", scope: !20, file: !19, line: 79, baseType: !6, size: 32, elements: !144, identifier: "_ZTSN7leveldb6Status4CodeE")
!19 = !DIFile(filename: "./include/leveldb/status.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!20 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Status", scope: !13, file: !19, line: 24, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !21, identifier: "_ZTSN7leveldb6StatusE")
!21 = !{!22, !26, !30, !31, !36, !40, !44, !47, !50, !119, !120, !121, !122, !123, !127, !128, !129, !130, !131, !132, !135, !138, !141}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "state_", scope: !20, file: !19, line: 100, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 27, type: !27, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!30 = !DISubprogram(name: "~Status", scope: !20, file: !19, line: 28, type: !27, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!31 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 30, type: !32, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !29, !34}
!34 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!36 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb6StatusaSERKS0_", scope: !20, file: !19, line: 31, type: !37, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !29, !34}
!39 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !20, size: 64)
!40 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 33, type: !41, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !29, !43}
!43 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !20, size: 64)
!44 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb6StatusaSEOS0_", scope: !20, file: !19, line: 34, type: !45, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!45 = !DISubroutineType(types: !46)
!46 = !{!39, !29, !43}
!47 = !DISubprogram(name: "OK", linkageName: "_ZN7leveldb6Status2OKEv", scope: !20, file: !19, line: 37, type: !48, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!48 = !DISubroutineType(types: !49)
!49 = !{!20}
!50 = !DISubprogram(name: "NotFound", linkageName: "_ZN7leveldb6Status8NotFoundERKNS_5SliceES3_", scope: !20, file: !19, line: 40, type: !51, scopeLine: 40, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!51 = !DISubroutineType(types: !52)
!52 = !{!20, !53, !53}
!53 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Slice", scope: !13, file: !56, line: 27, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !57, identifier: "_ZTSN7leveldb5SliceE")
!56 = !DIFile(filename: "./include/leveldb/slice.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!57 = !{!58, !59, !63, !67, !70, !81, !84, !87, !91, !95, !98, !102, !105, !106, !109, !112, !116}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data_", scope: !55, file: !56, line: 89, baseType: !23, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size_", scope: !55, file: !56, line: 90, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 30, type: !64, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!67 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 33, type: !68, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !66, !23, !60}
!70 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 36, type: !71, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !66, !73}
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !77, file: !76, line: 74, baseType: !79)
!76 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/stringfwd.h", directory: "")
!77 = !DINamespace(name: "__cxx11", scope: !78, exportSymbols: true)
!78 = !DINamespace(name: "std", scope: null)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::char_traits<char>, std::allocator<char> >", scope: !77, file: !80, line: 1607, size: 256, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE")
!80 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/basic_string.tcc", directory: "")
!81 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 39, type: !82, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !66, !23}
!84 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 42, type: !85, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !66, !53}
!87 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb5SliceaSERKS0_", scope: !55, file: !56, line: 43, type: !88, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !66, !53}
!90 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !55, size: 64)
!91 = !DISubprogram(name: "data", linkageName: "_ZNK7leveldb5Slice4dataEv", scope: !55, file: !56, line: 46, type: !92, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DISubroutineType(types: !93)
!93 = !{!23, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!95 = !DISubprogram(name: "size", linkageName: "_ZNK7leveldb5Slice4sizeEv", scope: !55, file: !56, line: 49, type: !96, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!96 = !DISubroutineType(types: !97)
!97 = !{!60, !94}
!98 = !DISubprogram(name: "empty", linkageName: "_ZNK7leveldb5Slice5emptyEv", scope: !55, file: !56, line: 52, type: !99, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !94}
!101 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!102 = !DISubprogram(name: "operator[]", linkageName: "_ZNK7leveldb5SliceixEm", scope: !55, file: !56, line: 56, type: !103, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{!25, !94, !60}
!105 = !DISubprogram(name: "clear", linkageName: "_ZN7leveldb5Slice5clearEv", scope: !55, file: !56, line: 62, type: !64, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!106 = !DISubprogram(name: "remove_prefix", linkageName: "_ZN7leveldb5Slice13remove_prefixEm", scope: !55, file: !56, line: 68, type: !107, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !66, !60}
!109 = !DISubprogram(name: "ToString", linkageName: "_ZNK7leveldb5Slice8ToStringB5cxx11Ev", scope: !55, file: !56, line: 75, type: !110, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{!75, !94}
!112 = !DISubprogram(name: "compare", linkageName: "_ZNK7leveldb5Slice7compareERKS0_", scope: !55, file: !56, line: 81, type: !113, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !94, !53}
!115 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!116 = !DISubprogram(name: "starts_with", linkageName: "_ZNK7leveldb5Slice11starts_withERKS0_", scope: !55, file: !56, line: 84, type: !117, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubroutineType(types: !118)
!118 = !{!101, !94, !53}
!119 = !DISubprogram(name: "Corruption", linkageName: "_ZN7leveldb6Status10CorruptionERKNS_5SliceES3_", scope: !20, file: !19, line: 43, type: !51, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!120 = !DISubprogram(name: "NotSupported", linkageName: "_ZN7leveldb6Status12NotSupportedERKNS_5SliceES3_", scope: !20, file: !19, line: 46, type: !51, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!121 = !DISubprogram(name: "InvalidArgument", linkageName: "_ZN7leveldb6Status15InvalidArgumentERKNS_5SliceES3_", scope: !20, file: !19, line: 49, type: !51, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!122 = !DISubprogram(name: "IOError", linkageName: "_ZN7leveldb6Status7IOErrorERKNS_5SliceES3_", scope: !20, file: !19, line: 52, type: !51, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!123 = !DISubprogram(name: "ok", linkageName: "_ZNK7leveldb6Status2okEv", scope: !20, file: !19, line: 57, type: !124, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!124 = !DISubroutineType(types: !125)
!125 = !{!101, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!127 = !DISubprogram(name: "IsNotFound", linkageName: "_ZNK7leveldb6Status10IsNotFoundEv", scope: !20, file: !19, line: 60, type: !124, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!128 = !DISubprogram(name: "IsCorruption", linkageName: "_ZNK7leveldb6Status12IsCorruptionEv", scope: !20, file: !19, line: 63, type: !124, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubprogram(name: "IsIOError", linkageName: "_ZNK7leveldb6Status9IsIOErrorEv", scope: !20, file: !19, line: 66, type: !124, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubprogram(name: "IsNotSupportedError", linkageName: "_ZNK7leveldb6Status19IsNotSupportedErrorEv", scope: !20, file: !19, line: 69, type: !124, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!131 = !DISubprogram(name: "IsInvalidArgument", linkageName: "_ZNK7leveldb6Status17IsInvalidArgumentEv", scope: !20, file: !19, line: 72, type: !124, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!132 = !DISubprogram(name: "ToString", linkageName: "_ZNK7leveldb6Status8ToStringB5cxx11Ev", scope: !20, file: !19, line: 76, type: !133, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DISubroutineType(types: !134)
!134 = !{!75, !126}
!135 = !DISubprogram(name: "code", linkageName: "_ZNK7leveldb6Status4codeEv", scope: !20, file: !19, line: 88, type: !136, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!136 = !DISubroutineType(types: !137)
!137 = !{!18, !126}
!138 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 92, type: !139, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !29, !18, !53, !53}
!141 = !DISubprogram(name: "CopyState", linkageName: "_ZN7leveldb6Status9CopyStateEPKc", scope: !20, file: !19, line: 93, type: !142, scopeLine: 93, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!142 = !DISubroutineType(types: !143)
!143 = !{!23, !23}
!144 = !{!145, !146, !147, !148, !149, !150}
!145 = !DIEnumerator(name: "kOk", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "kNotFound", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "kCorruption", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "kNotSupported", value: 3, isUnsigned: true)
!149 = !DIEnumerator(name: "kInvalidArgument", value: 4, isUnsigned: true)
!150 = !DIEnumerator(name: "kIOError", value: 5, isUnsigned: true)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !153, file: !152, line: 53, baseType: !6, size: 32, elements: !208, identifier: "_ZTSN7leveldb6FooterUt_E")
!152 = !DIFile(filename: "./table/format.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!153 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Footer", scope: !13, file: !152, line: 48, size: 256, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !154, identifier: "_ZTSN7leveldb6FooterE")
!154 = !{!155, !186, !187, !191, !197, !200, !201, !202, !205}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "metaindex_handle_", scope: !153, file: !152, line: 69, baseType: !156, size: 128)
!156 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BlockHandle", scope: !13, file: !152, line: 23, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !157, identifier: "_ZTSN7leveldb11BlockHandleE")
!157 = !{!158, !163, !164, !168, !173, !176, !177, !178, !182}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "offset_", scope: !156, file: !152, line: 42, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !160, line: 27, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !162, line: 44, baseType: !62)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "size_", scope: !156, file: !152, line: 43, baseType: !159, size: 64, offset: 64)
!164 = !DISubprogram(name: "BlockHandle", scope: !156, file: !152, line: 28, type: !165, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!168 = !DISubprogram(name: "offset", linkageName: "_ZNK7leveldb11BlockHandle6offsetEv", scope: !156, file: !152, line: 31, type: !169, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!169 = !DISubroutineType(types: !170)
!170 = !{!159, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!173 = !DISubprogram(name: "set_offset", linkageName: "_ZN7leveldb11BlockHandle10set_offsetEm", scope: !156, file: !152, line: 32, type: !174, scopeLine: 32, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !167, !159}
!176 = !DISubprogram(name: "size", linkageName: "_ZNK7leveldb11BlockHandle4sizeEv", scope: !156, file: !152, line: 35, type: !169, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!177 = !DISubprogram(name: "set_size", linkageName: "_ZN7leveldb11BlockHandle8set_sizeEm", scope: !156, file: !152, line: 36, type: !174, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!178 = !DISubprogram(name: "EncodeTo", linkageName: "_ZNK7leveldb11BlockHandle8EncodeToEPNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !156, file: !152, line: 38, type: !179, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !171, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!182 = !DISubprogram(name: "DecodeFrom", linkageName: "_ZN7leveldb11BlockHandle10DecodeFromEPNS_5SliceE", scope: !156, file: !152, line: 39, type: !183, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!183 = !DISubroutineType(types: !184)
!184 = !{!20, !167, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "index_handle_", scope: !153, file: !152, line: 70, baseType: !156, size: 128, offset: 128)
!187 = !DISubprogram(name: "Footer", scope: !153, file: !152, line: 55, type: !188, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!191 = !DISubprogram(name: "metaindex_handle", linkageName: "_ZNK7leveldb6Footer16metaindex_handleEv", scope: !153, file: !152, line: 58, type: !192, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !172, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!197 = !DISubprogram(name: "set_metaindex_handle", linkageName: "_ZN7leveldb6Footer20set_metaindex_handleERKNS_11BlockHandleE", scope: !153, file: !152, line: 59, type: !198, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !190, !194}
!200 = !DISubprogram(name: "index_handle", linkageName: "_ZNK7leveldb6Footer12index_handleEv", scope: !153, file: !152, line: 62, type: !192, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!201 = !DISubprogram(name: "set_index_handle", linkageName: "_ZN7leveldb6Footer16set_index_handleERKNS_11BlockHandleE", scope: !153, file: !152, line: 63, type: !198, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!202 = !DISubprogram(name: "EncodeTo", linkageName: "_ZNK7leveldb6Footer8EncodeToEPNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !153, file: !152, line: 65, type: !203, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !195, !181}
!205 = !DISubprogram(name: "DecodeFrom", linkageName: "_ZN7leveldb6Footer10DecodeFromEPNS_5SliceE", scope: !153, file: !152, line: 66, type: !206, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!206 = !DISubroutineType(types: !207)
!207 = !{!20, !190, !185}
!208 = !{!209}
!209 = !DIEnumerator(name: "kEncodedLength", value: 48, isUnsigned: true)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !79, file: !211, line: 158, baseType: !6, size: 32, elements: !212, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEUt_E")
!211 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/basic_string.h", directory: "")
!212 = !{!213}
!213 = !DIEnumerator(name: "_S_local_capacity", value: 15, isUnsigned: true)
!214 = !{!55, !215, !288, !159, !394, !395, !245, !398, !400, !419, !457, !79}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Table", scope: !13, file: !217, line: 26, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !218, identifier: "_ZTSN7leveldb5TableE")
!217 = !DIFile(filename: "./include/leveldb/table.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!218 = !{!219, !338, !344, !350, !354, !357, !371, !374, !378, !381, !387, !391}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rep_", scope: !216, file: !217, line: 79, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Rep", scope: !216, file: !1, line: 20, size: 1344, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !223, identifier: "_ZTSN7leveldb5Table3RepE")
!223 = !{!224, !263, !264, !267, !268, !285, !286, !287, !334}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !222, file: !1, line: 27, baseType: !225, size: 832)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Options", scope: !13, file: !12, line: 34, size: 832, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !226, identifier: "_ZTSN7leveldb7OptionsE")
!226 = !{!227, !232, !233, !234, !235, !239, !242, !243, !244, !248, !249, !250, !251, !252, !253, !254, !259}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !225, file: !12, line: 47, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_class_type, name: "Comparator", scope: !13, file: !231, line: 20, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb10ComparatorE")
!231 = !DIFile(filename: "./include/leveldb/comparator.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "create_if_missing", scope: !225, file: !12, line: 50, baseType: !101, size: 8, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "error_if_exists", scope: !225, file: !12, line: 53, baseType: !101, size: 8, offset: 72)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "paranoid_checks", scope: !225, file: !12, line: 60, baseType: !101, size: 8, offset: 80)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !225, file: !12, line: 65, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_class_type, name: "Env", scope: !13, file: !238, line: 51, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb3EnvE")
!238 = !DIFile(filename: "./include/leveldb/env.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "info_log", scope: !225, file: !12, line: 70, baseType: !240, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_class_type, name: "Logger", scope: !13, file: !238, line: 293, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb6LoggerE")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_size", scope: !225, file: !12, line: 83, baseType: !60, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_open_files", scope: !225, file: !12, line: 88, baseType: !115, size: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "block_cache", scope: !225, file: !12, line: 95, baseType: !245, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_class_type, name: "Cache", scope: !13, file: !247, line: 34, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb5CacheE")
!247 = !DIFile(filename: "./include/leveldb/cache.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !225, file: !12, line: 101, baseType: !60, size: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "block_restart_interval", scope: !225, file: !12, line: 106, baseType: !115, size: 32, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "max_file_size", scope: !225, file: !12, line: 116, baseType: !60, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !225, file: !12, line: 132, baseType: !11, size: 32, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "zstd_compression_level", scope: !225, file: !12, line: 136, baseType: !115, size: 32, offset: 672)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_logs", scope: !225, file: !12, line: 142, baseType: !101, size: 8, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filter_policy", scope: !225, file: !12, line: 147, baseType: !255, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!257 = !DICompositeType(tag: DW_TAG_class_type, name: "FilterPolicy", scope: !13, file: !258, line: 27, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb12FilterPolicyE")
!258 = !DIFile(filename: "./include/leveldb/filter_policy.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!259 = !DISubprogram(name: "Options", scope: !225, file: !12, line: 36, type: !260, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !222, file: !1, line: 28, baseType: !20, size: 64, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !222, file: !1, line: 29, baseType: !265, size: 64, offset: 896)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_class_type, name: "RandomAccessFile", scope: !13, file: !238, line: 252, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb16RandomAccessFileE")
!267 = !DIDerivedType(tag: DW_TAG_member, name: "cache_id", scope: !222, file: !1, line: 30, baseType: !159, size: 64, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !222, file: !1, line: 31, baseType: !269, size: 64, offset: 1024)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FilterBlockReader", scope: !13, file: !271, line: 52, size: 320, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !272, identifier: "_ZTSN7leveldb17FilterBlockReaderE")
!271 = !DIFile(filename: "./table/filter_block.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!272 = !{!273, !274, !275, !276, !277, !278, !282}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "policy_", scope: !270, file: !271, line: 59, baseType: !255, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data_", scope: !270, file: !271, line: 60, baseType: !23, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "offset_", scope: !270, file: !271, line: 61, baseType: !23, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_", scope: !270, file: !271, line: 62, baseType: !60, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "base_lg_", scope: !270, file: !271, line: 63, baseType: !60, size: 64, offset: 256)
!278 = !DISubprogram(name: "FilterBlockReader", scope: !270, file: !271, line: 55, type: !279, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !281, !255, !53}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!282 = !DISubprogram(name: "KeyMayMatch", linkageName: "_ZN7leveldb17FilterBlockReader11KeyMayMatchEmRKNS_5SliceE", scope: !270, file: !271, line: 56, type: !283, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{!101, !281, !159, !53}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "filter_data", scope: !222, file: !1, line: 32, baseType: !23, size: 64, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "metaindex_handle", scope: !222, file: !1, line: 34, baseType: !156, size: 128, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "index_block", scope: !222, file: !1, line: 35, baseType: !288, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Block", scope: !13, file: !290, line: 18, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !291, identifier: "_ZTSN7leveldb5BlockE")
!290 = !DIFile(filename: "./table/block.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!291 = !{!292, !293, !294, !297, !298, !309, !314, !318, !321, !325, !331}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data_", scope: !289, file: !290, line: 36, baseType: !23, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "size_", scope: !289, file: !290, line: 37, baseType: !60, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "restart_offset_", scope: !289, file: !290, line: 38, baseType: !295, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !160, line: 26, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !162, line: 41, baseType: !6)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "owned_", scope: !289, file: !290, line: 39, baseType: !101, size: 8, offset: 160)
!298 = !DISubprogram(name: "Block", scope: !289, file: !290, line: 21, type: !299, scopeLine: 21, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !301, !302}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!302 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlockContents", scope: !13, file: !152, line: 81, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !305, identifier: "_ZTSN7leveldb13BlockContentsE")
!305 = !{!306, !307, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !152, line: 82, baseType: !55, size: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cachable", scope: !304, file: !152, line: 83, baseType: !101, size: 8, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "heap_allocated", scope: !304, file: !152, line: 84, baseType: !101, size: 8, offset: 136)
!309 = !DISubprogram(name: "Block", scope: !289, file: !290, line: 23, type: !310, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !301, !312}
!312 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!314 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb5BlockaSERKS0_", scope: !289, file: !290, line: 24, type: !315, scopeLine: 24, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !301, !312}
!317 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !289, size: 64)
!318 = !DISubprogram(name: "~Block", scope: !289, file: !290, line: 26, type: !319, scopeLine: 26, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !301}
!321 = !DISubprogram(name: "size", linkageName: "_ZNK7leveldb5Block4sizeEv", scope: !289, file: !290, line: 28, type: !322, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubroutineType(types: !323)
!323 = !{!60, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!325 = !DISubprogram(name: "NewIterator", linkageName: "_ZN7leveldb5Block11NewIteratorEPKNS_10ComparatorE", scope: !289, file: !290, line: 29, type: !326, scopeLine: 29, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !301, !228}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_class_type, name: "Iterator", scope: !13, file: !330, line: 24, size: 320, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb8IteratorE")
!330 = !DIFile(filename: "./include/leveldb/iterator.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!331 = !DISubprogram(name: "NumRestarts", linkageName: "_ZNK7leveldb5Block11NumRestartsEv", scope: !289, file: !290, line: 34, type: !332, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!332 = !DISubroutineType(types: !333)
!333 = !{!295, !324}
!334 = !DISubprogram(name: "~Rep", scope: !222, file: !1, line: 21, type: !335, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!338 = !DISubprogram(name: "Open", linkageName: "_ZN7leveldb5Table4OpenERKNS_7OptionsEPNS_16RandomAccessFileEmPPS0_", scope: !216, file: !217, line: 40, type: !339, scopeLine: 40, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!339 = !DISubroutineType(types: !340)
!340 = !{!20, !341, !265, !159, !343}
!341 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!344 = !DISubprogram(name: "Table", scope: !216, file: !217, line: 43, type: !345, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347, !348}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!348 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!350 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb5TableaSERKS0_", scope: !216, file: !217, line: 44, type: !351, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!351 = !DISubroutineType(types: !352)
!352 = !{!353, !347, !348}
!353 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !216, size: 64)
!354 = !DISubprogram(name: "~Table", scope: !216, file: !217, line: 46, type: !355, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !347}
!357 = !DISubprogram(name: "NewIterator", linkageName: "_ZNK7leveldb5Table11NewIteratorERKNS_11ReadOptionsE", scope: !216, file: !217, line: 51, type: !358, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{!328, !360, !361}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!361 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOptions", scope: !13, file: !12, line: 151, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !364, identifier: "_ZTSN7leveldb11ReadOptionsE")
!364 = !{!365, !366, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "verify_checksums", scope: !363, file: !12, line: 154, baseType: !101, size: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fill_cache", scope: !363, file: !12, line: 158, baseType: !101, size: 8, offset: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "snapshot", scope: !363, file: !12, line: 164, baseType: !368, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_class_type, name: "Snapshot", scope: !13, file: !12, line: 19, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb8SnapshotE")
!371 = !DISubprogram(name: "ApproximateOffsetOf", linkageName: "_ZNK7leveldb5Table19ApproximateOffsetOfERKNS_5SliceE", scope: !216, file: !217, line: 59, type: !372, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!372 = !DISubroutineType(types: !373)
!373 = !{!159, !360, !53}
!374 = !DISubprogram(name: "BlockReader", linkageName: "_ZN7leveldb5Table11BlockReaderEPvRKNS_11ReadOptionsERKNS_5SliceE", scope: !216, file: !217, line: 65, type: !375, scopeLine: 65, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!328, !377, !361, !53}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!378 = !DISubprogram(name: "Table", scope: !216, file: !217, line: 67, type: !379, scopeLine: 67, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !347, !221}
!381 = !DISubprogram(name: "InternalGet", linkageName: "_ZN7leveldb5Table11InternalGetERKNS_11ReadOptionsERKNS_5SliceEPvPFvS7_S6_S6_E", scope: !216, file: !217, line: 72, type: !382, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!382 = !DISubroutineType(types: !383)
!383 = !{!20, !347, !361, !53, !377, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !377, !53, !53}
!387 = !DISubprogram(name: "ReadMeta", linkageName: "_ZN7leveldb5Table8ReadMetaERKNS_6FooterE", scope: !216, file: !217, line: 76, type: !388, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !347, !390}
!390 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !196, size: 64)
!391 = !DISubprogram(name: "ReadFilter", linkageName: "_ZN7leveldb5Table10ReadFilterERKNS_5SliceE", scope: !216, file: !217, line: 77, type: !392, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !347, !53}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !160, line: 24, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !162, line: 37, baseType: !397)
!397 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handle", scope: !246, file: !247, line: 46, size: 8, flags: DIFlagFwdDecl, identifier: "_ZTSN7leveldb5Cache6HandleE")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !79, file: !211, line: 88, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !403, file: !402, line: 61, baseType: !433)
!402 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/alloc_traits.h", directory: "")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<char> >", scope: !5, file: !402, line: 50, size: 8, flags: DIFlagTypePassByValue, elements: !404, templateParams: !439, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIcEEE")
!404 = !{!405, !441, !446, !450, !453, !454, !455, !456}
!405 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !403, baseType: !406, extraData: i32 0)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator_traits<std::allocator<char> >", scope: !78, file: !407, line: 384, size: 8, flags: DIFlagTypePassByValue, elements: !408, templateParams: !439, identifier: "_ZTSSt16allocator_traitsISaIcEE")
!407 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/alloc_traits.h", directory: "")
!408 = !{!409, !421, !427, !430, !436}
!409 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_m", scope: !406, file: !407, line: 435, type: !410, scopeLine: 435, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !414, !418}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !406, file: !407, line: 392, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !406, file: !407, line: 387, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_class_type, name: "allocator<char>", scope: !78, file: !417, line: 173, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSaIcE")
!417 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/allocator.h", directory: "")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !407, line: 407, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !78, file: !420, line: 231, baseType: !62)
!420 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/x86_64-linux-gnu/c++/7.5.0/bits/c++config.h", directory: "")
!421 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_mPKv", scope: !406, file: !407, line: 449, type: !422, scopeLine: 449, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!422 = !DISubroutineType(types: !423)
!423 = !{!412, !414, !418, !424}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_void_pointer", file: !407, line: 401, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!427 = !DISubprogram(name: "deallocate", linkageName: "_ZNSt16allocator_traitsISaIcEE10deallocateERS0_Pcm", scope: !406, file: !407, line: 461, type: !428, scopeLine: 461, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !414, !412, !418}
!430 = !DISubprogram(name: "max_size", linkageName: "_ZNSt16allocator_traitsISaIcEE8max_sizeERKS0_", scope: !406, file: !407, line: 495, type: !431, scopeLine: 495, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !406, file: !407, line: 407, baseType: !419)
!434 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!436 = !DISubprogram(name: "select_on_container_copy_construction", linkageName: "_ZNSt16allocator_traitsISaIcEE37select_on_container_copy_constructionERKS0_", scope: !406, file: !407, line: 504, type: !437, scopeLine: 504, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!437 = !DISubroutineType(types: !438)
!438 = !{!415, !434}
!439 = !{!440}
!440 = !DITemplateTypeParameter(name: "_Alloc", type: !416)
!441 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE17_S_select_on_copyERKS1_", scope: !403, file: !402, line: 94, type: !442, scopeLine: 94, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!416, !444}
!444 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!446 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE10_S_on_swapERS1_S3_", scope: !403, file: !402, line: 97, type: !447, scopeLine: 97, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !449, !449}
!449 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !416, size: 64)
!450 = !DISubprogram(name: "_S_propagate_on_copy_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE27_S_propagate_on_copy_assignEv", scope: !403, file: !402, line: 100, type: !451, scopeLine: 100, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!101}
!453 = !DISubprogram(name: "_S_propagate_on_move_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE27_S_propagate_on_move_assignEv", scope: !403, file: !402, line: 103, type: !451, scopeLine: 103, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!454 = !DISubprogram(name: "_S_propagate_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE20_S_propagate_on_swapEv", scope: !403, file: !402, line: 106, type: !451, scopeLine: 106, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!455 = !DISubprogram(name: "_S_always_equal", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE15_S_always_equalEv", scope: !403, file: !402, line: 109, type: !451, scopeLine: 109, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!456 = !DISubprogram(name: "_S_nothrow_move", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE15_S_nothrow_moveEv", scope: !403, file: !402, line: 112, type: !451, scopeLine: 112, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !460, file: !459, line: 277, baseType: !25)
!459 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/char_traits.h", directory: "")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !78, file: !459, line: 275, size: 8, flags: DIFlagTypePassByValue, elements: !461, templateParams: !507, identifier: "_ZTSSt11char_traitsIcE")
!461 = !{!462, !468, !471, !472, !476, !479, !482, !485, !486, !489, !495, !498, !501, !504}
!462 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignERcRKc", scope: !460, file: !459, line: 284, type: !463, scopeLine: 284, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465, !466}
!465 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !458, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!468 = !DISubprogram(name: "eq", linkageName: "_ZNSt11char_traitsIcE2eqERKcS2_", scope: !460, file: !459, line: 288, type: !469, scopeLine: 288, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!469 = !DISubroutineType(types: !470)
!470 = !{!101, !466, !466}
!471 = !DISubprogram(name: "lt", linkageName: "_ZNSt11char_traitsIcE2ltERKcS2_", scope: !460, file: !459, line: 292, type: !469, scopeLine: 292, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!472 = !DISubprogram(name: "compare", linkageName: "_ZNSt11char_traitsIcE7compareEPKcS2_m", scope: !460, file: !459, line: 300, type: !473, scopeLine: 300, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!473 = !DISubroutineType(types: !474)
!474 = !{!115, !475, !475, !419}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!476 = !DISubprogram(name: "length", linkageName: "_ZNSt11char_traitsIcE6lengthEPKc", scope: !460, file: !459, line: 314, type: !477, scopeLine: 314, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!477 = !DISubroutineType(types: !478)
!478 = !{!419, !475}
!479 = !DISubprogram(name: "find", linkageName: "_ZNSt11char_traitsIcE4findEPKcmRS1_", scope: !460, file: !459, line: 324, type: !480, scopeLine: 324, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!480 = !DISubroutineType(types: !481)
!481 = !{!475, !475, !419, !466}
!482 = !DISubprogram(name: "move", linkageName: "_ZNSt11char_traitsIcE4moveEPcPKcm", scope: !460, file: !459, line: 338, type: !483, scopeLine: 338, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!483 = !DISubroutineType(types: !484)
!484 = !{!457, !457, !475, !419}
!485 = !DISubprogram(name: "copy", linkageName: "_ZNSt11char_traitsIcE4copyEPcPKcm", scope: !460, file: !459, line: 346, type: !483, scopeLine: 346, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!486 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignEPcmc", scope: !460, file: !459, line: 354, type: !487, scopeLine: 354, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!487 = !DISubroutineType(types: !488)
!488 = !{!457, !457, !419, !458}
!489 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt11char_traitsIcE12to_char_typeERKi", scope: !460, file: !459, line: 362, type: !490, scopeLine: 362, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!490 = !DISubroutineType(types: !491)
!491 = !{!458, !492}
!492 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !460, file: !459, line: 278, baseType: !115)
!495 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt11char_traitsIcE11to_int_typeERKc", scope: !460, file: !459, line: 368, type: !496, scopeLine: 368, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(types: !497)
!497 = !{!494, !466}
!498 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt11char_traitsIcE11eq_int_typeERKiS2_", scope: !460, file: !459, line: 372, type: !499, scopeLine: 372, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(types: !500)
!500 = !{!101, !492, !492}
!501 = !DISubprogram(name: "eof", linkageName: "_ZNSt11char_traitsIcE3eofEv", scope: !460, file: !459, line: 376, type: !502, scopeLine: 376, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!502 = !DISubroutineType(types: !503)
!503 = !{!494}
!504 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt11char_traitsIcE7not_eofERKi", scope: !460, file: !459, line: 380, type: !505, scopeLine: 380, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!505 = !DISubroutineType(types: !506)
!506 = !{!494, !492}
!507 = !{!508}
!508 = !DITemplateTypeParameter(name: "_CharT", type: !25)
!509 = !{!510, !516, !520, !523, !527, !530, !532, !534, !536, !538, !540, !542, !544, !547, !549, !550, !554, !555, !556, !558, !560, !562, !564, !566, !568, !570, !572, !575, !577, !582, !588, !592, !598, !602, !606, !612, !616, !618, !620, !624, !628, !632, !636, !640, !642, !644, !646, !650, !654, !658, !660, !662, !666, !683, !686, !691, !743, !751, !755, !762, !766, !770, !772, !774, !778, !784, !788, !794, !800, !802, !806, !810, !814, !818, !829, !831, !835, !839, !843, !845, !849, !853, !857, !859, !861, !865, !873, !877, !881, !885, !887, !893, !895, !902, !907, !911, !915, !919, !923, !927, !929, !931, !935, !939, !943, !945, !949, !953, !955, !957, !961, !966, !971, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !1040, !1044, !1046, !1048, !1052, !1056, !1061, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1093, !1097, !1101, !1107, !1111, !1116, !1118, !1123, !1127, !1131, !1140, !1144, !1148, !1152, !1156, !1160, !1164, !1168, !1172, !1176, !1180, !1184, !1188, !1190, !1194, !1198, !1202, !1208, !1212, !1216, !1218, !1222, !1226, !1232, !1234, !1238, !1242, !1246, !1250, !1254, !1258, !1262, !1263, !1264, !1265, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1277, !1283, !1288, !1292, !1294, !1296, !1298, !1300, !1307, !1311, !1315, !1319, !1323, !1327, !1331, !1335, !1337, !1341, !1347, !1351, !1355, !1357, !1360, !1364, !1368, !1370, !1372, !1374, !1376, !1378, !1380, !1382, !1386, !1390, !1394, !1398, !1402, !1406, !1408, !1412, !1416, !1420, !1424, !1426, !1428, !1432, !1436, !1437, !1438, !1439, !1440, !1441, !1448, !1453, !1457, !1458, !1463, !1467, !1472, !1477, !1481, !1487, !1491, !1493, !1497, !1502, !1504}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !511, file: !515, line: 48)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !512, line: 24, baseType: !513)
!512 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !162, line: 36, baseType: !514)
!514 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!515 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstdint", directory: "")
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !517, file: !515, line: 49)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !512, line: 25, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !162, line: 38, baseType: !519)
!519 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !521, file: !515, line: 50)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !512, line: 26, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !162, line: 40, baseType: !115)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !524, file: !515, line: 51)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !512, line: 27, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !162, line: 43, baseType: !526)
!526 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !528, file: !515, line: 53)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !529, line: 68, baseType: !514)
!529 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !531, file: !515, line: 54)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !529, line: 70, baseType: !526)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !533, file: !515, line: 55)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !529, line: 71, baseType: !526)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !535, file: !515, line: 56)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !529, line: 72, baseType: !526)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !537, file: !515, line: 58)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !529, line: 43, baseType: !514)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !539, file: !515, line: 59)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !529, line: 44, baseType: !519)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !541, file: !515, line: 60)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !529, line: 45, baseType: !115)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !543, file: !515, line: 61)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !529, line: 47, baseType: !526)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !545, file: !515, line: 63)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !529, line: 111, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !162, line: 61, baseType: !526)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !548, file: !515, line: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !529, line: 97, baseType: !526)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !395, file: !515, line: 66)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !551, file: !515, line: 67)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !160, line: 25, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !162, line: 39, baseType: !553)
!553 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !295, file: !515, line: 68)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !159, file: !515, line: 69)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !557, file: !515, line: 71)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !529, line: 81, baseType: !397)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !559, file: !515, line: 72)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !529, line: 83, baseType: !62)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !561, file: !515, line: 73)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !529, line: 84, baseType: !62)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !563, file: !515, line: 74)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !529, line: 85, baseType: !62)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !565, file: !515, line: 76)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !529, line: 54, baseType: !397)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !567, file: !515, line: 77)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !529, line: 55, baseType: !553)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !569, file: !515, line: 78)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !529, line: 56, baseType: !6)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !571, file: !515, line: 79)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !529, line: 58, baseType: !62)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !573, file: !515, line: 81)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !529, line: 112, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !162, line: 62, baseType: !62)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !576, file: !515, line: 82)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !529, line: 100, baseType: !62)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !578, file: !581, line: 56)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !579, line: 24, baseType: !580)
!579 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/__stddef_max_align_t.h", directory: "")
!580 = !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 19, size: 256, flags: DIFlagFwdDecl, identifier: "_ZTS11max_align_t")
!581 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstddef", directory: "")
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !583, file: !587, line: 75)
!583 = !DISubprogram(name: "memchr", scope: !584, file: !584, line: 90, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DIFile(filename: "/usr/include/string.h", directory: "")
!585 = !DISubroutineType(types: !586)
!586 = !{!377, !425, !115, !60}
!587 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstring", directory: "")
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !589, file: !587, line: 76)
!589 = !DISubprogram(name: "memcmp", scope: !584, file: !584, line: 63, type: !590, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!590 = !DISubroutineType(types: !591)
!591 = !{!115, !425, !425, !60}
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !593, file: !587, line: 77)
!593 = !DISubprogram(name: "memcpy", scope: !584, file: !584, line: 42, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!594 = !DISubroutineType(types: !595)
!595 = !{!377, !596, !597, !60}
!596 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !377)
!597 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !425)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !599, file: !587, line: 78)
!599 = !DISubprogram(name: "memmove", scope: !584, file: !584, line: 46, type: !600, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!600 = !DISubroutineType(types: !601)
!601 = !{!377, !377, !425, !60}
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !603, file: !587, line: 79)
!603 = !DISubprogram(name: "memset", scope: !584, file: !584, line: 60, type: !604, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!604 = !DISubroutineType(types: !605)
!605 = !{!377, !377, !115, !60}
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !607, file: !587, line: 80)
!607 = !DISubprogram(name: "strcat", scope: !584, file: !584, line: 129, type: !608, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DISubroutineType(types: !609)
!609 = !{!413, !610, !611}
!610 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !413)
!611 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !23)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !613, file: !587, line: 81)
!613 = !DISubprogram(name: "strcmp", scope: !584, file: !584, line: 136, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DISubroutineType(types: !615)
!615 = !{!115, !23, !23}
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !617, file: !587, line: 82)
!617 = !DISubprogram(name: "strcoll", scope: !584, file: !584, line: 143, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !619, file: !587, line: 83)
!619 = !DISubprogram(name: "strcpy", scope: !584, file: !584, line: 121, type: !608, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !621, file: !587, line: 84)
!621 = !DISubprogram(name: "strcspn", scope: !584, file: !584, line: 272, type: !622, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DISubroutineType(types: !623)
!623 = !{!60, !23, !23}
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !625, file: !587, line: 85)
!625 = !DISubprogram(name: "strerror", scope: !584, file: !584, line: 396, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!626 = !DISubroutineType(types: !627)
!627 = !{!413, !115}
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !629, file: !587, line: 86)
!629 = !DISubprogram(name: "strlen", scope: !584, file: !584, line: 384, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!630 = !DISubroutineType(types: !631)
!631 = !{!60, !23}
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !633, file: !587, line: 87)
!633 = !DISubprogram(name: "strncat", scope: !584, file: !584, line: 132, type: !634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!634 = !DISubroutineType(types: !635)
!635 = !{!413, !610, !611, !60}
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !637, file: !587, line: 88)
!637 = !DISubprogram(name: "strncmp", scope: !584, file: !584, line: 139, type: !638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!638 = !DISubroutineType(types: !639)
!639 = !{!115, !23, !23, !60}
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !641, file: !587, line: 89)
!641 = !DISubprogram(name: "strncpy", scope: !584, file: !584, line: 124, type: !634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !643, file: !587, line: 90)
!643 = !DISubprogram(name: "strspn", scope: !584, file: !584, line: 276, type: !622, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !645, file: !587, line: 91)
!645 = !DISubprogram(name: "strtok", scope: !584, file: !584, line: 335, type: !608, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !647, file: !587, line: 92)
!647 = !DISubprogram(name: "strxfrm", scope: !584, file: !584, line: 146, type: !648, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!648 = !DISubroutineType(types: !649)
!649 = !{!60, !610, !611, !60}
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !651, file: !587, line: 93)
!651 = !DISubprogram(name: "strchr", scope: !584, file: !584, line: 225, type: !652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!652 = !DISubroutineType(types: !653)
!653 = !{!413, !23, !115}
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !655, file: !587, line: 94)
!655 = !DISubprogram(name: "strpbrk", scope: !584, file: !584, line: 302, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!656 = !DISubroutineType(types: !657)
!657 = !{!413, !23, !23}
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !659, file: !587, line: 95)
!659 = !DISubprogram(name: "strrchr", scope: !584, file: !584, line: 252, type: !652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !661, file: !587, line: 96)
!661 = !DISubprogram(name: "strstr", scope: !584, file: !584, line: 329, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!662 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !663, entity: !664, file: !665, line: 58)
!663 = !DINamespace(name: "__gnu_debug", scope: null)
!664 = !DINamespace(name: "__debug", scope: !78)
!665 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/debug/debug.h", directory: "")
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !667, file: !682, line: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !668, line: 6, baseType: !669)
!668 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !670, line: 21, baseType: !671)
!670 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !672, identifier: "_ZTS11__mbstate_t")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !671, file: !670, line: 15, baseType: !115, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !671, file: !670, line: 20, baseType: !675, size: 32, offset: 32)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !671, file: !670, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !676, identifier: "_ZTSN11__mbstate_tUt_E")
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !675, file: !670, line: 18, baseType: !6, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !675, file: !670, line: 19, baseType: !679, size: 32)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 4)
!682 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cwchar", directory: "")
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !684, file: !682, line: 139)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !685, line: 20, baseType: !6)
!685 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !687, file: !682, line: 141)
!687 = !DISubprogram(name: "btowc", scope: !688, file: !688, line: 318, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!688 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!689 = !DISubroutineType(types: !690)
!690 = !{!684, !115}
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !692, file: !682, line: 142)
!692 = !DISubprogram(name: "fgetwc", scope: !688, file: !688, line: 727, type: !693, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!693 = !DISubroutineType(types: !694)
!694 = !{!684, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !697, line: 5, baseType: !698)
!697 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !699, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !700, identifier: "_ZTS8_IO_FILE")
!699 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !716, !718, !719, !720, !722, !723, !724, !728, !731, !733, !734, !735, !736, !737, !738, !739}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !698, file: !699, line: 246, baseType: !115, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !698, file: !699, line: 251, baseType: !413, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !698, file: !699, line: 252, baseType: !413, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !698, file: !699, line: 253, baseType: !413, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !698, file: !699, line: 254, baseType: !413, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !698, file: !699, line: 255, baseType: !413, size: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !698, file: !699, line: 256, baseType: !413, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !698, file: !699, line: 257, baseType: !413, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !698, file: !699, line: 258, baseType: !413, size: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !698, file: !699, line: 260, baseType: !413, size: 64, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !698, file: !699, line: 261, baseType: !413, size: 64, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !698, file: !699, line: 262, baseType: !413, size: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !698, file: !699, line: 264, baseType: !714, size: 64, offset: 768)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !699, line: 160, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !698, file: !699, line: 266, baseType: !717, size: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !698, file: !699, line: 268, baseType: !115, size: 32, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !698, file: !699, line: 272, baseType: !115, size: 32, offset: 928)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !698, file: !699, line: 274, baseType: !721, size: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !162, line: 140, baseType: !526)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !698, file: !699, line: 278, baseType: !553, size: 16, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !698, file: !699, line: 279, baseType: !514, size: 8, offset: 1040)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !698, file: !699, line: 280, baseType: !725, size: 8, offset: 1048)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 1)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !698, file: !699, line: 284, baseType: !729, size: 64, offset: 1088)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !699, line: 154, baseType: null)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !698, file: !699, line: 293, baseType: !732, size: 64, offset: 1152)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !162, line: 141, baseType: !526)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !698, file: !699, line: 301, baseType: !377, size: 64, offset: 1216)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !698, file: !699, line: 302, baseType: !377, size: 64, offset: 1280)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !698, file: !699, line: 303, baseType: !377, size: 64, offset: 1344)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !698, file: !699, line: 304, baseType: !377, size: 64, offset: 1408)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !698, file: !699, line: 306, baseType: !60, size: 64, offset: 1472)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !698, file: !699, line: 307, baseType: !115, size: 32, offset: 1536)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !698, file: !699, line: 309, baseType: !740, size: 160, offset: 1568)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 20)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !744, file: !682, line: 143)
!744 = !DISubprogram(name: "fgetws", scope: !688, file: !688, line: 756, type: !745, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !749, !115, !750}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!749 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !747)
!750 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !695)
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !752, file: !682, line: 144)
!752 = !DISubprogram(name: "fputwc", scope: !688, file: !688, line: 741, type: !753, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!753 = !DISubroutineType(types: !754)
!754 = !{!684, !748, !695}
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !756, file: !682, line: 145)
!756 = !DISubprogram(name: "fputws", scope: !688, file: !688, line: 763, type: !757, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!757 = !DISubroutineType(types: !758)
!758 = !{!115, !759, !750}
!759 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !763, file: !682, line: 146)
!763 = !DISubprogram(name: "fwide", scope: !688, file: !688, line: 573, type: !764, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!764 = !DISubroutineType(types: !765)
!765 = !{!115, !695, !115}
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !767, file: !682, line: 147)
!767 = !DISubprogram(name: "fwprintf", scope: !688, file: !688, line: 580, type: !768, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!768 = !DISubroutineType(types: !769)
!769 = !{!115, !750, !759, null}
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !771, file: !682, line: 148)
!771 = !DISubprogram(name: "fwscanf", scope: !688, file: !688, line: 621, type: !768, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !773, file: !682, line: 149)
!773 = !DISubprogram(name: "getwc", scope: !688, file: !688, line: 728, type: !693, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !775, file: !682, line: 150)
!775 = !DISubprogram(name: "getwchar", scope: !688, file: !688, line: 734, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!776 = !DISubroutineType(types: !777)
!777 = !{!684}
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !779, file: !682, line: 151)
!779 = !DISubprogram(name: "mbrlen", scope: !688, file: !688, line: 329, type: !780, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!780 = !DISubroutineType(types: !781)
!781 = !{!60, !611, !60, !782}
!782 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !785, file: !682, line: 152)
!785 = !DISubprogram(name: "mbrtowc", scope: !688, file: !688, line: 296, type: !786, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!786 = !DISubroutineType(types: !787)
!787 = !{!60, !749, !611, !60, !782}
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !789, file: !682, line: 153)
!789 = !DISubprogram(name: "mbsinit", scope: !688, file: !688, line: 292, type: !790, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!790 = !DISubroutineType(types: !791)
!791 = !{!115, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !795, file: !682, line: 154)
!795 = !DISubprogram(name: "mbsrtowcs", scope: !688, file: !688, line: 337, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!796 = !DISubroutineType(types: !797)
!797 = !{!60, !749, !798, !60, !782}
!798 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !801, file: !682, line: 155)
!801 = !DISubprogram(name: "putwc", scope: !688, file: !688, line: 742, type: !753, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !803, file: !682, line: 156)
!803 = !DISubprogram(name: "putwchar", scope: !688, file: !688, line: 748, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!804 = !DISubroutineType(types: !805)
!805 = !{!684, !748}
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !807, file: !682, line: 158)
!807 = !DISubprogram(name: "swprintf", scope: !688, file: !688, line: 590, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!808 = !DISubroutineType(types: !809)
!809 = !{!115, !749, !60, !759, null}
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !811, file: !682, line: 160)
!811 = !DISubprogram(name: "swscanf", scope: !688, file: !688, line: 631, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!812 = !DISubroutineType(types: !813)
!813 = !{!115, !759, !759, null}
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !815, file: !682, line: 161)
!815 = !DISubprogram(name: "ungetwc", scope: !688, file: !688, line: 771, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!816 = !DISubroutineType(types: !817)
!817 = !{!684, !684, !695}
!818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !819, file: !682, line: 162)
!819 = !DISubprogram(name: "vfwprintf", scope: !688, file: !688, line: 598, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!820 = !DISubroutineType(types: !821)
!821 = !{!115, !750, !759, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !824, identifier: "_ZTS13__va_list_tag")
!824 = !{!825, !826, !827, !828}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !823, file: !1, baseType: !6, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !823, file: !1, baseType: !6, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !823, file: !1, baseType: !377, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !823, file: !1, baseType: !377, size: 64, offset: 128)
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !830, file: !682, line: 164)
!830 = !DISubprogram(name: "vfwscanf", scope: !688, file: !688, line: 673, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !832, file: !682, line: 167)
!832 = !DISubprogram(name: "vswprintf", scope: !688, file: !688, line: 611, type: !833, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!833 = !DISubroutineType(types: !834)
!834 = !{!115, !749, !60, !759, !822}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !836, file: !682, line: 170)
!836 = !DISubprogram(name: "vswscanf", scope: !688, file: !688, line: 685, type: !837, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!837 = !DISubroutineType(types: !838)
!838 = !{!115, !759, !759, !822}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !840, file: !682, line: 172)
!840 = !DISubprogram(name: "vwprintf", scope: !688, file: !688, line: 606, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DISubroutineType(types: !842)
!842 = !{!115, !759, !822}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !844, file: !682, line: 174)
!844 = !DISubprogram(name: "vwscanf", scope: !688, file: !688, line: 681, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !846, file: !682, line: 176)
!846 = !DISubprogram(name: "wcrtomb", scope: !688, file: !688, line: 301, type: !847, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!847 = !DISubroutineType(types: !848)
!848 = !{!60, !610, !748, !782}
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !850, file: !682, line: 177)
!850 = !DISubprogram(name: "wcscat", scope: !688, file: !688, line: 97, type: !851, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!851 = !DISubroutineType(types: !852)
!852 = !{!747, !749, !759}
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !854, file: !682, line: 178)
!854 = !DISubprogram(name: "wcscmp", scope: !688, file: !688, line: 106, type: !855, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!855 = !DISubroutineType(types: !856)
!856 = !{!115, !760, !760}
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !858, file: !682, line: 179)
!858 = !DISubprogram(name: "wcscoll", scope: !688, file: !688, line: 131, type: !855, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !860, file: !682, line: 180)
!860 = !DISubprogram(name: "wcscpy", scope: !688, file: !688, line: 87, type: !851, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !862, file: !682, line: 181)
!862 = !DISubprogram(name: "wcscspn", scope: !688, file: !688, line: 187, type: !863, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!863 = !DISubroutineType(types: !864)
!864 = !{!60, !760, !760}
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !866, file: !682, line: 182)
!866 = !DISubprogram(name: "wcsftime", scope: !688, file: !688, line: 835, type: !867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!867 = !DISubroutineType(types: !868)
!868 = !{!60, !749, !60, !759, !869}
!869 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !688, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !874, file: !682, line: 183)
!874 = !DISubprogram(name: "wcslen", scope: !688, file: !688, line: 222, type: !875, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!875 = !DISubroutineType(types: !876)
!876 = !{!60, !760}
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !878, file: !682, line: 184)
!878 = !DISubprogram(name: "wcsncat", scope: !688, file: !688, line: 101, type: !879, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!879 = !DISubroutineType(types: !880)
!880 = !{!747, !749, !759, !60}
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !882, file: !682, line: 185)
!882 = !DISubprogram(name: "wcsncmp", scope: !688, file: !688, line: 109, type: !883, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!883 = !DISubroutineType(types: !884)
!884 = !{!115, !760, !760, !60}
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !886, file: !682, line: 186)
!886 = !DISubprogram(name: "wcsncpy", scope: !688, file: !688, line: 92, type: !879, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !888, file: !682, line: 187)
!888 = !DISubprogram(name: "wcsrtombs", scope: !688, file: !688, line: 343, type: !889, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!889 = !DISubroutineType(types: !890)
!890 = !{!60, !610, !891, !60, !782}
!891 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !894, file: !682, line: 188)
!894 = !DISubprogram(name: "wcsspn", scope: !688, file: !688, line: 191, type: !863, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !896, file: !682, line: 189)
!896 = !DISubprogram(name: "wcstod", scope: !688, file: !688, line: 377, type: !897, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!897 = !DISubroutineType(types: !898)
!898 = !{!899, !759, !900}
!899 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!900 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !903, file: !682, line: 191)
!903 = !DISubprogram(name: "wcstof", scope: !688, file: !688, line: 382, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!904 = !DISubroutineType(types: !905)
!905 = !{!906, !759, !900}
!906 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!907 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !908, file: !682, line: 193)
!908 = !DISubprogram(name: "wcstok", scope: !688, file: !688, line: 217, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!909 = !DISubroutineType(types: !910)
!910 = !{!747, !749, !759, !900}
!911 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !912, file: !682, line: 194)
!912 = !DISubprogram(name: "wcstol", scope: !688, file: !688, line: 428, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!913 = !DISubroutineType(types: !914)
!914 = !{!526, !759, !900, !115}
!915 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !916, file: !682, line: 195)
!916 = !DISubprogram(name: "wcstoul", scope: !688, file: !688, line: 433, type: !917, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!917 = !DISubroutineType(types: !918)
!918 = !{!62, !759, !900, !115}
!919 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !920, file: !682, line: 196)
!920 = !DISubprogram(name: "wcsxfrm", scope: !688, file: !688, line: 135, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!921 = !DISubroutineType(types: !922)
!922 = !{!60, !749, !759, !60}
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !924, file: !682, line: 197)
!924 = !DISubprogram(name: "wctob", scope: !688, file: !688, line: 324, type: !925, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!925 = !DISubroutineType(types: !926)
!926 = !{!115, !684}
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !928, file: !682, line: 198)
!928 = !DISubprogram(name: "wmemcmp", scope: !688, file: !688, line: 258, type: !883, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !930, file: !682, line: 199)
!930 = !DISubprogram(name: "wmemcpy", scope: !688, file: !688, line: 262, type: !879, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !932, file: !682, line: 200)
!932 = !DISubprogram(name: "wmemmove", scope: !688, file: !688, line: 267, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!933 = !DISubroutineType(types: !934)
!934 = !{!747, !747, !760, !60}
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !936, file: !682, line: 201)
!936 = !DISubprogram(name: "wmemset", scope: !688, file: !688, line: 271, type: !937, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!937 = !DISubroutineType(types: !938)
!938 = !{!747, !747, !748, !60}
!939 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !940, file: !682, line: 202)
!940 = !DISubprogram(name: "wprintf", scope: !688, file: !688, line: 587, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!941 = !DISubroutineType(types: !942)
!942 = !{!115, !759, null}
!943 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !944, file: !682, line: 203)
!944 = !DISubprogram(name: "wscanf", scope: !688, file: !688, line: 628, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!945 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !946, file: !682, line: 204)
!946 = !DISubprogram(name: "wcschr", scope: !688, file: !688, line: 164, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!947 = !DISubroutineType(types: !948)
!948 = !{!747, !760, !748}
!949 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !950, file: !682, line: 205)
!950 = !DISubprogram(name: "wcspbrk", scope: !688, file: !688, line: 201, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!951 = !DISubroutineType(types: !952)
!952 = !{!747, !760, !760}
!953 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !954, file: !682, line: 206)
!954 = !DISubprogram(name: "wcsrchr", scope: !688, file: !688, line: 174, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!955 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !956, file: !682, line: 207)
!956 = !DISubprogram(name: "wcsstr", scope: !688, file: !688, line: 212, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!957 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !958, file: !682, line: 208)
!958 = !DISubprogram(name: "wmemchr", scope: !688, file: !688, line: 253, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!959 = !DISubroutineType(types: !960)
!960 = !{!747, !760, !748, !60}
!961 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !962, file: !682, line: 248)
!962 = !DISubprogram(name: "wcstold", scope: !688, file: !688, line: 384, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!963 = !DISubroutineType(types: !964)
!964 = !{!965, !759, !900}
!965 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!966 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !967, file: !682, line: 257)
!967 = !DISubprogram(name: "wcstoll", scope: !688, file: !688, line: 441, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!968 = !DISubroutineType(types: !969)
!969 = !{!970, !759, !900, !115}
!970 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!971 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !972, file: !682, line: 258)
!972 = !DISubprogram(name: "wcstoull", scope: !688, file: !688, line: 448, type: !973, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!973 = !DISubroutineType(types: !974)
!974 = !{!975, !759, !900, !115}
!975 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!976 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !962, file: !682, line: 264)
!977 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !967, file: !682, line: 265)
!978 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !972, file: !682, line: 266)
!979 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !903, file: !682, line: 280)
