; ModuleID = 'db/table_cache.cc'
source_filename = "db/table_cache.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"class.leveldb::TableCache" = type { %"class.leveldb::Env"*, %"class.std::__cxx11::basic_string", %"struct.leveldb::Options"*, %"class.leveldb::Cache"* }
%"class.leveldb::Env" = type { i32 (...)** }
%"class.std::__cxx11::basic_string" = type { %"struct.std::__cxx11::basic_string<char>::_Alloc_hider", i64, %union.anon }
%"struct.std::__cxx11::basic_string<char>::_Alloc_hider" = type { i8* }
%union.anon = type { i64, [8 x i8] }
%"class.leveldb::Cache" = type { i32 (...)** }
%"struct.leveldb::Options" = type { %"class.leveldb::Comparator"*, i8, i8, i8, %"class.leveldb::Env"*, %"class.leveldb::Logger"*, i64, i32, %"class.leveldb::Cache"*, i64, i32, i64, i32, i32, i8, %"class.leveldb::FilterPolicy"* }
%"class.leveldb::Comparator" = type { i32 (...)** }
%"class.leveldb::Logger" = type { i32 (...)** }
%"class.leveldb::FilterPolicy" = type { i32 (...)** }
%"class.std::allocator" = type { i8 }
%"struct.std::__false_type" = type { i8 }
%"struct.std::forward_iterator_tag" = type { i8 }
%"class.leveldb::Status" = type { i8* }
%"struct.leveldb::Cache::Handle" = type { i8 }
%"class.leveldb::Slice" = type { i8*, i64 }
%"class.leveldb::RandomAccessFile" = type { i32 (...)** }
%"class.leveldb::Table" = type { %"struct.leveldb::Table::Rep"* }
%"struct.leveldb::Table::Rep" = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "Ubuntu clang version 12.0.1-++20211102090516+fed41342a82f-1~exp1~20211102211019.11", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !155, imports: !382, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "db/table_cache.cc", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!2 = !{!3, !11, !18, !151}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Lock_policy", scope: !5, file: !4, line: 49, baseType: !6, size: 32, elements: !7, identifier: "_ZTSN9__gnu_cxx12_Lock_policyE")
!4 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/concurrence.h", directory: "")
!5 = !DINamespace(name: "__gnu_cxx", scope: null)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "_S_single", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "_S_mutex", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "_S_atomic", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CompressionType", scope: !13, file: !12, line: 25, baseType: !6, size: 32, elements: !14, identifier: "_ZTSN7leveldb15CompressionTypeE")
!12 = !DIFile(filename: "./include/leveldb/options.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!13 = !DINamespace(name: "leveldb", scope: null)
!14 = !{!15, !16, !17}
!15 = !DIEnumerator(name: "kNoCompression", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "kSnappyCompression", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "kZstdCompression", value: 2, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Code", scope: !20, file: !19, line: 79, baseType: !6, size: 32, elements: !144, identifier: "_ZTSN7leveldb6Status4CodeE")
!19 = !DIFile(filename: "./include/leveldb/status.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!20 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Status", scope: !13, file: !19, line: 24, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !21, identifier: "_ZTSN7leveldb6StatusE")
!21 = !{!22, !26, !30, !31, !36, !40, !44, !47, !50, !119, !120, !121, !122, !123, !127, !128, !129, !130, !131, !132, !135, !138, !141}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "state_", scope: !20, file: !19, line: 100, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 27, type: !27, scopeLine: 27, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!30 = !DISubprogram(name: "~Status", scope: !20, file: !19, line: 28, type: !27, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!31 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 30, type: !32, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !29, !34}
!34 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!36 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb6StatusaSERKS0_", scope: !20, file: !19, line: 31, type: !37, scopeLine: 31, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !29, !34}
!39 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !20, size: 64)
!40 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 33, type: !41, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !29, !43}
!43 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !20, size: 64)
!44 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb6StatusaSEOS0_", scope: !20, file: !19, line: 34, type: !45, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!45 = !DISubroutineType(types: !46)
!46 = !{!39, !29, !43}
!47 = !DISubprogram(name: "OK", linkageName: "_ZN7leveldb6Status2OKEv", scope: !20, file: !19, line: 37, type: !48, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!48 = !DISubroutineType(types: !49)
!49 = !{!20}
!50 = !DISubprogram(name: "NotFound", linkageName: "_ZN7leveldb6Status8NotFoundERKNS_5SliceES3_", scope: !20, file: !19, line: 40, type: !51, scopeLine: 40, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!51 = !DISubroutineType(types: !52)
!52 = !{!20, !53, !53}
!53 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Slice", scope: !13, file: !56, line: 27, size: 128, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !57, identifier: "_ZTSN7leveldb5SliceE")
!56 = !DIFile(filename: "./include/leveldb/slice.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!57 = !{!58, !59, !63, !67, !70, !81, !84, !87, !91, !95, !98, !102, !105, !106, !109, !112, !116}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "data_", scope: !55, file: !56, line: 89, baseType: !23, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size_", scope: !55, file: !56, line: 90, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 30, type: !64, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!67 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 33, type: !68, scopeLine: 33, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !66, !23, !60}
!70 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 36, type: !71, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !66, !73}
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !77, file: !76, line: 74, baseType: !79)
!76 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/stringfwd.h", directory: "")
!77 = !DINamespace(name: "__cxx11", scope: !78, exportSymbols: true)
!78 = !DINamespace(name: "std", scope: null)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::char_traits<char>, std::allocator<char> >", scope: !77, file: !80, line: 1607, size: 256, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE")
!80 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/basic_string.tcc", directory: "")
!81 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 39, type: !82, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !66, !23}
!84 = !DISubprogram(name: "Slice", scope: !55, file: !56, line: 42, type: !85, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !66, !53}
!87 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb5SliceaSERKS0_", scope: !55, file: !56, line: 43, type: !88, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !66, !53}
!90 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !55, size: 64)
!91 = !DISubprogram(name: "data", linkageName: "_ZNK7leveldb5Slice4dataEv", scope: !55, file: !56, line: 46, type: !92, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DISubroutineType(types: !93)
!93 = !{!23, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!95 = !DISubprogram(name: "size", linkageName: "_ZNK7leveldb5Slice4sizeEv", scope: !55, file: !56, line: 49, type: !96, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!96 = !DISubroutineType(types: !97)
!97 = !{!60, !94}
!98 = !DISubprogram(name: "empty", linkageName: "_ZNK7leveldb5Slice5emptyEv", scope: !55, file: !56, line: 52, type: !99, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !94}
!101 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!102 = !DISubprogram(name: "operator[]", linkageName: "_ZNK7leveldb5SliceixEm", scope: !55, file: !56, line: 56, type: !103, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{!25, !94, !60}
!105 = !DISubprogram(name: "clear", linkageName: "_ZN7leveldb5Slice5clearEv", scope: !55, file: !56, line: 62, type: !64, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!106 = !DISubprogram(name: "remove_prefix", linkageName: "_ZN7leveldb5Slice13remove_prefixEm", scope: !55, file: !56, line: 68, type: !107, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !66, !60}
!109 = !DISubprogram(name: "ToString", linkageName: "_ZNK7leveldb5Slice8ToStringB5cxx11Ev", scope: !55, file: !56, line: 75, type: !110, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!110 = !DISubroutineType(types: !111)
!111 = !{!75, !94}
!112 = !DISubprogram(name: "compare", linkageName: "_ZNK7leveldb5Slice7compareERKS0_", scope: !55, file: !56, line: 81, type: !113, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !94, !53}
!115 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!116 = !DISubprogram(name: "starts_with", linkageName: "_ZNK7leveldb5Slice11starts_withERKS0_", scope: !55, file: !56, line: 84, type: !117, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!117 = !DISubroutineType(types: !118)
!118 = !{!101, !94, !53}
!119 = !DISubprogram(name: "Corruption", linkageName: "_ZN7leveldb6Status10CorruptionERKNS_5SliceES3_", scope: !20, file: !19, line: 43, type: !51, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!120 = !DISubprogram(name: "NotSupported", linkageName: "_ZN7leveldb6Status12NotSupportedERKNS_5SliceES3_", scope: !20, file: !19, line: 46, type: !51, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!121 = !DISubprogram(name: "InvalidArgument", linkageName: "_ZN7leveldb6Status15InvalidArgumentERKNS_5SliceES3_", scope: !20, file: !19, line: 49, type: !51, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!122 = !DISubprogram(name: "IOError", linkageName: "_ZN7leveldb6Status7IOErrorERKNS_5SliceES3_", scope: !20, file: !19, line: 52, type: !51, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!123 = !DISubprogram(name: "ok", linkageName: "_ZNK7leveldb6Status2okEv", scope: !20, file: !19, line: 57, type: !124, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!124 = !DISubroutineType(types: !125)
!125 = !{!101, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!127 = !DISubprogram(name: "IsNotFound", linkageName: "_ZNK7leveldb6Status10IsNotFoundEv", scope: !20, file: !19, line: 60, type: !124, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!128 = !DISubprogram(name: "IsCorruption", linkageName: "_ZNK7leveldb6Status12IsCorruptionEv", scope: !20, file: !19, line: 63, type: !124, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!129 = !DISubprogram(name: "IsIOError", linkageName: "_ZNK7leveldb6Status9IsIOErrorEv", scope: !20, file: !19, line: 66, type: !124, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubprogram(name: "IsNotSupportedError", linkageName: "_ZNK7leveldb6Status19IsNotSupportedErrorEv", scope: !20, file: !19, line: 69, type: !124, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!131 = !DISubprogram(name: "IsInvalidArgument", linkageName: "_ZNK7leveldb6Status17IsInvalidArgumentEv", scope: !20, file: !19, line: 72, type: !124, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!132 = !DISubprogram(name: "ToString", linkageName: "_ZNK7leveldb6Status8ToStringB5cxx11Ev", scope: !20, file: !19, line: 76, type: !133, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!133 = !DISubroutineType(types: !134)
!134 = !{!75, !126}
!135 = !DISubprogram(name: "code", linkageName: "_ZNK7leveldb6Status4codeEv", scope: !20, file: !19, line: 88, type: !136, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!136 = !DISubroutineType(types: !137)
!137 = !{!18, !126}
!138 = !DISubprogram(name: "Status", scope: !20, file: !19, line: 92, type: !139, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !29, !18, !53, !53}
!141 = !DISubprogram(name: "CopyState", linkageName: "_ZN7leveldb6Status9CopyStateEPKc", scope: !20, file: !19, line: 93, type: !142, scopeLine: 93, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!142 = !DISubroutineType(types: !143)
!143 = !{!23, !23}
!144 = !{!145, !146, !147, !148, !149, !150}
!145 = !DIEnumerator(name: "kOk", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "kNotFound", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "kCorruption", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "kNotSupported", value: 3, isUnsigned: true)
!149 = !DIEnumerator(name: "kInvalidArgument", value: 4, isUnsigned: true)
!150 = !DIEnumerator(name: "kIOError", value: 5, isUnsigned: true)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !79, file: !152, line: 158, baseType: !6, size: 32, elements: !153, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEUt_E")
!152 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/basic_string.h", directory: "")
!153 = !{!154}
!154 = !DIEnumerator(name: "_S_local_capacity", value: 15, isUnsigned: true)
!155 = !{!156, !267, !268, !196, !271, !273, !330}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TableAndFile", scope: !13, file: !1, line: 14, size: 128, flags: DIFlagTypePassByValue, elements: !158, identifier: "_ZTSN7leveldb12TableAndFileE")
!158 = !{!159, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !157, file: !1, line: 15, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_class_type, name: "RandomAccessFile", scope: !13, file: !162, line: 252, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb16RandomAccessFileE")
!162 = !DIFile(filename: "./include/leveldb/env.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!163 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !157, file: !1, line: 16, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Table", scope: !13, file: !166, line: 26, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !167, identifier: "_ZTSN7leveldb5TableE")
!166 = !DIFile(filename: "./include/leveldb/table.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!167 = !{!168, !172, !219, !225, !229, !232, !242, !245, !249, !252, !258, !264}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rep_", scope: !165, file: !166, line: 79, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Rep", scope: !165, file: !166, line: 63, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb5Table3RepE")
!172 = !DISubprogram(name: "Open", linkageName: "_ZN7leveldb5Table4OpenERKNS_7OptionsEPNS_16RandomAccessFileEmPPS0_", scope: !165, file: !166, line: 40, type: !173, scopeLine: 40, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!173 = !DISubroutineType(types: !174)
!174 = !{!20, !175, !160, !214, !218}
!175 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Options", scope: !13, file: !12, line: 34, size: 832, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !178, identifier: "_ZTSN7leveldb7OptionsE")
!178 = !{!179, !184, !185, !186, !187, !190, !193, !194, !195, !199, !200, !201, !202, !203, !204, !205, !210}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "comparator", scope: !177, file: !12, line: 47, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_class_type, name: "Comparator", scope: !13, file: !183, line: 20, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb10ComparatorE")
!183 = !DIFile(filename: "./include/leveldb/comparator.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "create_if_missing", scope: !177, file: !12, line: 50, baseType: !101, size: 8, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "error_if_exists", scope: !177, file: !12, line: 53, baseType: !101, size: 8, offset: 72)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "paranoid_checks", scope: !177, file: !12, line: 60, baseType: !101, size: 8, offset: 80)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !177, file: !12, line: 65, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_class_type, name: "Env", scope: !13, file: !162, line: 51, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb3EnvE")
!190 = !DIDerivedType(tag: DW_TAG_member, name: "info_log", scope: !177, file: !12, line: 70, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_class_type, name: "Logger", scope: !13, file: !162, line: 293, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb6LoggerE")
!193 = !DIDerivedType(tag: DW_TAG_member, name: "write_buffer_size", scope: !177, file: !12, line: 83, baseType: !60, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "max_open_files", scope: !177, file: !12, line: 88, baseType: !115, size: 32, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "block_cache", scope: !177, file: !12, line: 95, baseType: !196, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_class_type, name: "Cache", scope: !13, file: !198, line: 34, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb5CacheE")
!198 = !DIFile(filename: "./include/leveldb/cache.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !177, file: !12, line: 101, baseType: !60, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "block_restart_interval", scope: !177, file: !12, line: 106, baseType: !115, size: 32, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "max_file_size", scope: !177, file: !12, line: 116, baseType: !60, size: 64, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !177, file: !12, line: 132, baseType: !11, size: 32, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "zstd_compression_level", scope: !177, file: !12, line: 136, baseType: !115, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_logs", scope: !177, file: !12, line: 142, baseType: !101, size: 8, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filter_policy", scope: !177, file: !12, line: 147, baseType: !206, size: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_class_type, name: "FilterPolicy", scope: !13, file: !209, line: 27, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb12FilterPolicyE")
!209 = !DIFile(filename: "./include/leveldb/filter_policy.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!210 = !DISubprogram(name: "Options", scope: !177, file: !12, line: 36, type: !211, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !215, line: 27, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !217, line: 44, baseType: !62)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!219 = !DISubprogram(name: "Table", scope: !165, file: !166, line: 43, type: !220, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !223}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!223 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!225 = !DISubprogram(name: "operator=", linkageName: "_ZN7leveldb5TableaSERKS0_", scope: !165, file: !166, line: 44, type: !226, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized | DISPFlagDeleted)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !222, !223}
!228 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !165, size: 64)
!229 = !DISubprogram(name: "~Table", scope: !165, file: !166, line: 46, type: !230, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !222}
!232 = !DISubprogram(name: "NewIterator", linkageName: "_ZNK7leveldb5Table11NewIteratorERKNS_11ReadOptionsE", scope: !165, file: !166, line: 51, type: !233, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !238, !239}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_class_type, name: "Iterator", scope: !13, file: !237, line: 24, size: 320, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb8IteratorE")
!237 = !DIFile(filename: "./include/leveldb/iterator.h", directory: "/users/fabricio/afp-all/TinyQuanta/leveldb")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!239 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadOptions", scope: !13, file: !12, line: 151, size: 128, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb11ReadOptionsE")
!242 = !DISubprogram(name: "ApproximateOffsetOf", linkageName: "_ZNK7leveldb5Table19ApproximateOffsetOfERKNS_5SliceE", scope: !165, file: !166, line: 59, type: !243, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!214, !238, !53}
!245 = !DISubprogram(name: "BlockReader", linkageName: "_ZN7leveldb5Table11BlockReaderEPvRKNS_11ReadOptionsERKNS_5SliceE", scope: !165, file: !166, line: 65, type: !246, scopeLine: 65, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!235, !248, !239, !53}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!249 = !DISubprogram(name: "Table", scope: !165, file: !166, line: 67, type: !250, scopeLine: 67, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !222, !170}
!252 = !DISubprogram(name: "InternalGet", linkageName: "_ZN7leveldb5Table11InternalGetERKNS_11ReadOptionsERKNS_5SliceEPvPFvS7_S6_S6_E", scope: !165, file: !166, line: 72, type: !253, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubroutineType(types: !254)
!254 = !{!20, !222, !239, !53, !248, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !248, !53, !53}
!258 = !DISubprogram(name: "ReadMeta", linkageName: "_ZN7leveldb5Table8ReadMetaERKNS_6FooterE", scope: !165, file: !166, line: 76, type: !259, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !222, !261}
!261 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DICompositeType(tag: DW_TAG_class_type, name: "Footer", scope: !13, file: !166, line: 17, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSN7leveldb6FooterE")
!264 = !DISubprogram(name: "ReadFilter", linkageName: "_ZN7leveldb5Table10ReadFilterERKNS_5SliceE", scope: !165, file: !166, line: 77, type: !265, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !222, !53}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !215, line: 24, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !217, line: 37, baseType: !270)
!270 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handle", scope: !197, file: !198, line: 46, size: 8, flags: DIFlagFwdDecl, identifier: "_ZTSN7leveldb5Cache6HandleE")
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !79, file: !152, line: 88, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !276, file: !275, line: 61, baseType: !306)
!275 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/alloc_traits.h", directory: "")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<char> >", scope: !5, file: !275, line: 50, size: 8, flags: DIFlagTypePassByValue, elements: !277, templateParams: !312, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIcEEE")
!277 = !{!278, !314, !319, !323, !326, !327, !328, !329}
!278 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !276, baseType: !279, extraData: i32 0)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator_traits<std::allocator<char> >", scope: !78, file: !280, line: 384, size: 8, flags: DIFlagTypePassByValue, elements: !281, templateParams: !312, identifier: "_ZTSSt16allocator_traitsISaIcEE")
!280 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/alloc_traits.h", directory: "")
!281 = !{!282, !294, !300, !303, !309}
!282 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_m", scope: !279, file: !280, line: 435, type: !283, scopeLine: 435, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !287, !291}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !279, file: !280, line: 392, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !279, file: !280, line: 387, baseType: !289)
!289 = !DICompositeType(tag: DW_TAG_class_type, name: "allocator<char>", scope: !78, file: !290, line: 173, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSaIcE")
!290 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/allocator.h", directory: "")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !280, line: 407, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !78, file: !293, line: 231, baseType: !62)
!293 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/x86_64-linux-gnu/c++/7.5.0/bits/c++config.h", directory: "")
!294 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_mPKv", scope: !279, file: !280, line: 449, type: !295, scopeLine: 449, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!295 = !DISubroutineType(types: !296)
!296 = !{!285, !287, !291, !297}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_void_pointer", file: !280, line: 401, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!300 = !DISubprogram(name: "deallocate", linkageName: "_ZNSt16allocator_traitsISaIcEE10deallocateERS0_Pcm", scope: !279, file: !280, line: 461, type: !301, scopeLine: 461, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !287, !285, !291}
!303 = !DISubprogram(name: "max_size", linkageName: "_ZNSt16allocator_traitsISaIcEE8max_sizeERKS0_", scope: !279, file: !280, line: 495, type: !304, scopeLine: 495, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !279, file: !280, line: 407, baseType: !292)
!307 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!309 = !DISubprogram(name: "select_on_container_copy_construction", linkageName: "_ZNSt16allocator_traitsISaIcEE37select_on_container_copy_constructionERKS0_", scope: !279, file: !280, line: 504, type: !310, scopeLine: 504, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!310 = !DISubroutineType(types: !311)
!311 = !{!288, !307}
!312 = !{!313}
!313 = !DITemplateTypeParameter(name: "_Alloc", type: !289)
!314 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE17_S_select_on_copyERKS1_", scope: !276, file: !275, line: 94, type: !315, scopeLine: 94, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!315 = !DISubroutineType(types: !316)
!316 = !{!289, !317}
!317 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!319 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE10_S_on_swapERS1_S3_", scope: !276, file: !275, line: 97, type: !320, scopeLine: 97, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322, !322}
!322 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !289, size: 64)
!323 = !DISubprogram(name: "_S_propagate_on_copy_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE27_S_propagate_on_copy_assignEv", scope: !276, file: !275, line: 100, type: !324, scopeLine: 100, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!324 = !DISubroutineType(types: !325)
!325 = !{!101}
!326 = !DISubprogram(name: "_S_propagate_on_move_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE27_S_propagate_on_move_assignEv", scope: !276, file: !275, line: 103, type: !324, scopeLine: 103, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!327 = !DISubprogram(name: "_S_propagate_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE20_S_propagate_on_swapEv", scope: !276, file: !275, line: 106, type: !324, scopeLine: 106, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!328 = !DISubprogram(name: "_S_always_equal", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE15_S_always_equalEv", scope: !276, file: !275, line: 109, type: !324, scopeLine: 109, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!329 = !DISubprogram(name: "_S_nothrow_move", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE15_S_nothrow_moveEv", scope: !276, file: !275, line: 112, type: !324, scopeLine: 112, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !333, file: !332, line: 277, baseType: !25)
!332 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/char_traits.h", directory: "")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !78, file: !332, line: 275, size: 8, flags: DIFlagTypePassByValue, elements: !334, templateParams: !380, identifier: "_ZTSSt11char_traitsIcE")
!334 = !{!335, !341, !344, !345, !349, !352, !355, !358, !359, !362, !368, !371, !374, !377}
!335 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignERcRKc", scope: !333, file: !332, line: 284, type: !336, scopeLine: 284, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !338, !339}
!338 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !331, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!341 = !DISubprogram(name: "eq", linkageName: "_ZNSt11char_traitsIcE2eqERKcS2_", scope: !333, file: !332, line: 288, type: !342, scopeLine: 288, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!342 = !DISubroutineType(types: !343)
!343 = !{!101, !339, !339}
!344 = !DISubprogram(name: "lt", linkageName: "_ZNSt11char_traitsIcE2ltERKcS2_", scope: !333, file: !332, line: 292, type: !342, scopeLine: 292, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!345 = !DISubprogram(name: "compare", linkageName: "_ZNSt11char_traitsIcE7compareEPKcS2_m", scope: !333, file: !332, line: 300, type: !346, scopeLine: 300, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!346 = !DISubroutineType(types: !347)
!347 = !{!115, !348, !348, !292}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!349 = !DISubprogram(name: "length", linkageName: "_ZNSt11char_traitsIcE6lengthEPKc", scope: !333, file: !332, line: 314, type: !350, scopeLine: 314, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!292, !348}
!352 = !DISubprogram(name: "find", linkageName: "_ZNSt11char_traitsIcE4findEPKcmRS1_", scope: !333, file: !332, line: 324, type: !353, scopeLine: 324, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!353 = !DISubroutineType(types: !354)
!354 = !{!348, !348, !292, !339}
!355 = !DISubprogram(name: "move", linkageName: "_ZNSt11char_traitsIcE4moveEPcPKcm", scope: !333, file: !332, line: 338, type: !356, scopeLine: 338, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!356 = !DISubroutineType(types: !357)
!357 = !{!330, !330, !348, !292}
!358 = !DISubprogram(name: "copy", linkageName: "_ZNSt11char_traitsIcE4copyEPcPKcm", scope: !333, file: !332, line: 346, type: !356, scopeLine: 346, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!359 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignEPcmc", scope: !333, file: !332, line: 354, type: !360, scopeLine: 354, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{!330, !330, !292, !331}
!362 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt11char_traitsIcE12to_char_typeERKi", scope: !333, file: !332, line: 362, type: !363, scopeLine: 362, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!363 = !DISubroutineType(types: !364)
!364 = !{!331, !365}
!365 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !333, file: !332, line: 278, baseType: !115)
!368 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt11char_traitsIcE11to_int_typeERKc", scope: !333, file: !332, line: 368, type: !369, scopeLine: 368, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!369 = !DISubroutineType(types: !370)
!370 = !{!367, !339}
!371 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt11char_traitsIcE11eq_int_typeERKiS2_", scope: !333, file: !332, line: 372, type: !372, scopeLine: 372, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!372 = !DISubroutineType(types: !373)
!373 = !{!101, !365, !365}
!374 = !DISubprogram(name: "eof", linkageName: "_ZNSt11char_traitsIcE3eofEv", scope: !333, file: !332, line: 376, type: !375, scopeLine: 376, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!367}
!377 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt11char_traitsIcE7not_eofERKi", scope: !333, file: !332, line: 380, type: !378, scopeLine: 380, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!378 = !DISubroutineType(types: !379)
!379 = !{!367, !365}
!380 = !{!381}
!381 = !DITemplateTypeParameter(name: "_CharT", type: !25)
!382 = !{!383, !389, !393, !396, !400, !403, !405, !407, !409, !411, !413, !415, !417, !420, !422, !423, !427, !430, !431, !433, !435, !437, !439, !441, !443, !445, !447, !450, !452, !456, !473, !476, !481, !533, !541, !545, !552, !556, !560, !562, !564, !568, !575, !579, !585, !591, !593, !597, !601, !605, !609, !620, !622, !626, !630, !634, !636, !641, !645, !649, !651, !653, !657, !665, !669, !673, !677, !679, !685, !687, !694, !699, !703, !707, !711, !715, !719, !721, !723, !727, !731, !735, !737, !741, !745, !747, !749, !753, !758, !763, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !832, !836, !838, !840, !844, !848, !853, !859, !861, !863, !865, !867, !869, !871, !873, !875, !877, !879, !881, !883, !885, !889, !893, !899, !903, !908, !910, !915, !919, !923, !932, !936, !940, !944, !948, !952, !956, !960, !964, !968, !972, !976, !980, !982, !986, !990, !994, !1000, !1004, !1008, !1010, !1014, !1018, !1024, !1026, !1030, !1034, !1038, !1042, !1046, !1050, !1054, !1055, !1056, !1057, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1069, !1075, !1080, !1084, !1086, !1088, !1090, !1092, !1099, !1103, !1107, !1111, !1115, !1119, !1124, !1128, !1130, !1134, !1140, !1144, !1149, !1151, !1154, !1158, !1162, !1164, !1166, !1168, !1170, !1174, !1176, !1178, !1182, !1186, !1190, !1194, !1198, !1202, !1204, !1208, !1212, !1216, !1220, !1222, !1224, !1228, !1232, !1233, !1234, !1235, !1236, !1237, !1242, !1248, !1252, !1256, !1260, !1264, !1268, !1270, !1272, !1274, !1278, !1282, !1286, !1290, !1294, !1296, !1298, !1300, !1304, !1308, !1312, !1314, !1316, !1321, !1325, !1326, !1331, !1335, !1340, !1345, !1349, !1355, !1359, !1361, !1365, !1370, !1372, !1375}
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !384, file: !388, line: 48)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !385, line: 24, baseType: !386)
!385 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !217, line: 36, baseType: !387)
!387 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!388 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstdint", directory: "")
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !390, file: !388, line: 49)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !385, line: 25, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !217, line: 38, baseType: !392)
!392 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !394, file: !388, line: 50)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !385, line: 26, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !217, line: 40, baseType: !115)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !397, file: !388, line: 51)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !385, line: 27, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !217, line: 43, baseType: !399)
!399 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !401, file: !388, line: 53)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !402, line: 68, baseType: !387)
!402 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !404, file: !388, line: 54)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !402, line: 70, baseType: !399)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !406, file: !388, line: 55)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !402, line: 71, baseType: !399)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !408, file: !388, line: 56)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !402, line: 72, baseType: !399)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !410, file: !388, line: 58)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !402, line: 43, baseType: !387)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !412, file: !388, line: 59)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !402, line: 44, baseType: !392)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !414, file: !388, line: 60)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !402, line: 45, baseType: !115)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !416, file: !388, line: 61)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !402, line: 47, baseType: !399)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !418, file: !388, line: 63)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !402, line: 111, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !217, line: 61, baseType: !399)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !421, file: !388, line: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !402, line: 97, baseType: !399)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !268, file: !388, line: 66)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !424, file: !388, line: 67)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !215, line: 25, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !217, line: 39, baseType: !426)
!426 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !428, file: !388, line: 68)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !215, line: 26, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !217, line: 41, baseType: !6)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !214, file: !388, line: 69)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !432, file: !388, line: 71)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !402, line: 81, baseType: !270)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !434, file: !388, line: 72)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !402, line: 83, baseType: !62)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !436, file: !388, line: 73)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !402, line: 84, baseType: !62)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !438, file: !388, line: 74)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !402, line: 85, baseType: !62)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !440, file: !388, line: 76)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !402, line: 54, baseType: !270)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !442, file: !388, line: 77)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !402, line: 55, baseType: !426)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !444, file: !388, line: 78)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !402, line: 56, baseType: !6)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !446, file: !388, line: 79)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !402, line: 58, baseType: !62)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !448, file: !388, line: 81)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !402, line: 112, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !217, line: 62, baseType: !62)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !451, file: !388, line: 82)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !402, line: 100, baseType: !62)
!452 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !453, entity: !454, file: !455, line: 58)
!453 = !DINamespace(name: "__gnu_debug", scope: null)
!454 = !DINamespace(name: "__debug", scope: !78)
!455 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/debug/debug.h", directory: "")
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !457, file: !472, line: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !458, line: 6, baseType: !459)
!458 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !460, line: 21, baseType: !461)
!460 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !462, identifier: "_ZTS11__mbstate_t")
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !461, file: !460, line: 15, baseType: !115, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !461, file: !460, line: 20, baseType: !465, size: 32, offset: 32)
!465 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !461, file: !460, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !466, identifier: "_ZTSN11__mbstate_tUt_E")
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !465, file: !460, line: 18, baseType: !6, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !465, file: !460, line: 19, baseType: !469, size: 32)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 4)
!472 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cwchar", directory: "")
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !474, file: !472, line: 139)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !475, line: 20, baseType: !6)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !477, file: !472, line: 141)
!477 = !DISubprogram(name: "btowc", scope: !478, file: !478, line: 318, type: !479, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!479 = !DISubroutineType(types: !480)
!480 = !{!474, !115}
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !482, file: !472, line: 142)
!482 = !DISubprogram(name: "fgetwc", scope: !478, file: !478, line: 727, type: !483, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!483 = !DISubroutineType(types: !484)
!484 = !{!474, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !487, line: 5, baseType: !488)
!487 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !489, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !490, identifier: "_ZTS8_IO_FILE")
!489 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !506, !508, !509, !510, !512, !513, !514, !518, !521, !523, !524, !525, !526, !527, !528, !529}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !488, file: !489, line: 246, baseType: !115, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !488, file: !489, line: 251, baseType: !286, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !488, file: !489, line: 252, baseType: !286, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !488, file: !489, line: 253, baseType: !286, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !488, file: !489, line: 254, baseType: !286, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !488, file: !489, line: 255, baseType: !286, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !488, file: !489, line: 256, baseType: !286, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !488, file: !489, line: 257, baseType: !286, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !488, file: !489, line: 258, baseType: !286, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !488, file: !489, line: 260, baseType: !286, size: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !488, file: !489, line: 261, baseType: !286, size: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !488, file: !489, line: 262, baseType: !286, size: 64, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !488, file: !489, line: 264, baseType: !504, size: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !489, line: 160, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !488, file: !489, line: 266, baseType: !507, size: 64, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !488, file: !489, line: 268, baseType: !115, size: 32, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !488, file: !489, line: 272, baseType: !115, size: 32, offset: 928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !488, file: !489, line: 274, baseType: !511, size: 64, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !217, line: 140, baseType: !399)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !488, file: !489, line: 278, baseType: !426, size: 16, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !488, file: !489, line: 279, baseType: !387, size: 8, offset: 1040)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !488, file: !489, line: 280, baseType: !515, size: 8, offset: 1048)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 1)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !488, file: !489, line: 284, baseType: !519, size: 64, offset: 1088)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !489, line: 154, baseType: null)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !488, file: !489, line: 293, baseType: !522, size: 64, offset: 1152)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !217, line: 141, baseType: !399)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !488, file: !489, line: 301, baseType: !248, size: 64, offset: 1216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !488, file: !489, line: 302, baseType: !248, size: 64, offset: 1280)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !488, file: !489, line: 303, baseType: !248, size: 64, offset: 1344)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !488, file: !489, line: 304, baseType: !248, size: 64, offset: 1408)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !488, file: !489, line: 306, baseType: !60, size: 64, offset: 1472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !488, file: !489, line: 307, baseType: !115, size: 32, offset: 1536)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !488, file: !489, line: 309, baseType: !530, size: 160, offset: 1568)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 20)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !534, file: !472, line: 143)
!534 = !DISubprogram(name: "fgetws", scope: !478, file: !478, line: 756, type: !535, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !539, !115, !540}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!539 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !537)
!540 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !485)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !542, file: !472, line: 144)
!542 = !DISubprogram(name: "fputwc", scope: !478, file: !478, line: 741, type: !543, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!543 = !DISubroutineType(types: !544)
!544 = !{!474, !538, !485}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !546, file: !472, line: 145)
!546 = !DISubprogram(name: "fputws", scope: !478, file: !478, line: 763, type: !547, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DISubroutineType(types: !548)
!548 = !{!115, !549, !540}
!549 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !553, file: !472, line: 146)
!553 = !DISubprogram(name: "fwide", scope: !478, file: !478, line: 573, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!554 = !DISubroutineType(types: !555)
!555 = !{!115, !485, !115}
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !557, file: !472, line: 147)
!557 = !DISubprogram(name: "fwprintf", scope: !478, file: !478, line: 580, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!558 = !DISubroutineType(types: !559)
!559 = !{!115, !540, !549, null}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !561, file: !472, line: 148)
!561 = !DISubprogram(name: "fwscanf", scope: !478, file: !478, line: 621, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !563, file: !472, line: 149)
!563 = !DISubprogram(name: "getwc", scope: !478, file: !478, line: 728, type: !483, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !565, file: !472, line: 150)
!565 = !DISubprogram(name: "getwchar", scope: !478, file: !478, line: 734, type: !566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!566 = !DISubroutineType(types: !567)
!567 = !{!474}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !569, file: !472, line: 151)
!569 = !DISubprogram(name: "mbrlen", scope: !478, file: !478, line: 329, type: !570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!570 = !DISubroutineType(types: !571)
!571 = !{!60, !572, !60, !573}
!572 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !23)
!573 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !576, file: !472, line: 152)
!576 = !DISubprogram(name: "mbrtowc", scope: !478, file: !478, line: 296, type: !577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubroutineType(types: !578)
!578 = !{!60, !539, !572, !60, !573}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !580, file: !472, line: 153)
!580 = !DISubprogram(name: "mbsinit", scope: !478, file: !478, line: 292, type: !581, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!581 = !DISubroutineType(types: !582)
!582 = !{!115, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !586, file: !472, line: 154)
!586 = !DISubprogram(name: "mbsrtowcs", scope: !478, file: !478, line: 337, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!587 = !DISubroutineType(types: !588)
!588 = !{!60, !539, !589, !60, !573}
!589 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !592, file: !472, line: 155)
!592 = !DISubprogram(name: "putwc", scope: !478, file: !478, line: 742, type: !543, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !594, file: !472, line: 156)
!594 = !DISubprogram(name: "putwchar", scope: !478, file: !478, line: 748, type: !595, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!595 = !DISubroutineType(types: !596)
!596 = !{!474, !538}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !598, file: !472, line: 158)
!598 = !DISubprogram(name: "swprintf", scope: !478, file: !478, line: 590, type: !599, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!599 = !DISubroutineType(types: !600)
!600 = !{!115, !539, !60, !549, null}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !602, file: !472, line: 160)
!602 = !DISubprogram(name: "swscanf", scope: !478, file: !478, line: 631, type: !603, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!603 = !DISubroutineType(types: !604)
!604 = !{!115, !549, !549, null}
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !606, file: !472, line: 161)
!606 = !DISubprogram(name: "ungetwc", scope: !478, file: !478, line: 771, type: !607, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!607 = !DISubroutineType(types: !608)
!608 = !{!474, !474, !485}
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !610, file: !472, line: 162)
!610 = !DISubprogram(name: "vfwprintf", scope: !478, file: !478, line: 598, type: !611, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!611 = !DISubroutineType(types: !612)
!612 = !{!115, !540, !549, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !615, identifier: "_ZTS13__va_list_tag")
!615 = !{!616, !617, !618, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !614, file: !1, baseType: !6, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !614, file: !1, baseType: !6, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !614, file: !1, baseType: !248, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !614, file: !1, baseType: !248, size: 64, offset: 128)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !621, file: !472, line: 164)
!621 = !DISubprogram(name: "vfwscanf", scope: !478, file: !478, line: 673, type: !611, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !623, file: !472, line: 167)
!623 = !DISubprogram(name: "vswprintf", scope: !478, file: !478, line: 611, type: !624, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!624 = !DISubroutineType(types: !625)
!625 = !{!115, !539, !60, !549, !613}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !627, file: !472, line: 170)
!627 = !DISubprogram(name: "vswscanf", scope: !478, file: !478, line: 685, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!628 = !DISubroutineType(types: !629)
!629 = !{!115, !549, !549, !613}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !631, file: !472, line: 172)
!631 = !DISubprogram(name: "vwprintf", scope: !478, file: !478, line: 606, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!632 = !DISubroutineType(types: !633)
!633 = !{!115, !549, !613}
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !635, file: !472, line: 174)
!635 = !DISubprogram(name: "vwscanf", scope: !478, file: !478, line: 681, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !637, file: !472, line: 176)
!637 = !DISubprogram(name: "wcrtomb", scope: !478, file: !478, line: 301, type: !638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!638 = !DISubroutineType(types: !639)
!639 = !{!60, !640, !538, !573}
!640 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !286)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !642, file: !472, line: 177)
!642 = !DISubprogram(name: "wcscat", scope: !478, file: !478, line: 97, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!643 = !DISubroutineType(types: !644)
!644 = !{!537, !539, !549}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !646, file: !472, line: 178)
!646 = !DISubprogram(name: "wcscmp", scope: !478, file: !478, line: 106, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!647 = !DISubroutineType(types: !648)
!648 = !{!115, !550, !550}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !650, file: !472, line: 179)
!650 = !DISubprogram(name: "wcscoll", scope: !478, file: !478, line: 131, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !652, file: !472, line: 180)
!652 = !DISubprogram(name: "wcscpy", scope: !478, file: !478, line: 87, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !654, file: !472, line: 181)
!654 = !DISubprogram(name: "wcscspn", scope: !478, file: !478, line: 187, type: !655, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!655 = !DISubroutineType(types: !656)
!656 = !{!60, !550, !550}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !658, file: !472, line: 182)
!658 = !DISubprogram(name: "wcsftime", scope: !478, file: !478, line: 835, type: !659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!659 = !DISubroutineType(types: !660)
!660 = !{!60, !539, !60, !549, !661}
!661 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !478, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !666, file: !472, line: 183)
!666 = !DISubprogram(name: "wcslen", scope: !478, file: !478, line: 222, type: !667, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!667 = !DISubroutineType(types: !668)
!668 = !{!60, !550}
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !670, file: !472, line: 184)
!670 = !DISubprogram(name: "wcsncat", scope: !478, file: !478, line: 101, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!671 = !DISubroutineType(types: !672)
!672 = !{!537, !539, !549, !60}
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !674, file: !472, line: 185)
!674 = !DISubprogram(name: "wcsncmp", scope: !478, file: !478, line: 109, type: !675, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!675 = !DISubroutineType(types: !676)
!676 = !{!115, !550, !550, !60}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !678, file: !472, line: 186)
!678 = !DISubprogram(name: "wcsncpy", scope: !478, file: !478, line: 92, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !680, file: !472, line: 187)
!680 = !DISubprogram(name: "wcsrtombs", scope: !478, file: !478, line: 343, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!681 = !DISubroutineType(types: !682)
!682 = !{!60, !640, !683, !60, !573}
!683 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !686, file: !472, line: 188)
!686 = !DISubprogram(name: "wcsspn", scope: !478, file: !478, line: 191, type: !655, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !688, file: !472, line: 189)
!688 = !DISubprogram(name: "wcstod", scope: !478, file: !478, line: 377, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !549, !692}
!691 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!692 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !695, file: !472, line: 191)
!695 = !DISubprogram(name: "wcstof", scope: !478, file: !478, line: 382, type: !696, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!696 = !DISubroutineType(types: !697)
!697 = !{!698, !549, !692}
!698 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !700, file: !472, line: 193)
!700 = !DISubprogram(name: "wcstok", scope: !478, file: !478, line: 217, type: !701, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!701 = !DISubroutineType(types: !702)
!702 = !{!537, !539, !549, !692}
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !704, file: !472, line: 194)
!704 = !DISubprogram(name: "wcstol", scope: !478, file: !478, line: 428, type: !705, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!705 = !DISubroutineType(types: !706)
!706 = !{!399, !549, !692, !115}
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !708, file: !472, line: 195)
!708 = !DISubprogram(name: "wcstoul", scope: !478, file: !478, line: 433, type: !709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!709 = !DISubroutineType(types: !710)
!710 = !{!62, !549, !692, !115}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !712, file: !472, line: 196)
!712 = !DISubprogram(name: "wcsxfrm", scope: !478, file: !478, line: 135, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!713 = !DISubroutineType(types: !714)
!714 = !{!60, !539, !549, !60}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !716, file: !472, line: 197)
!716 = !DISubprogram(name: "wctob", scope: !478, file: !478, line: 324, type: !717, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!717 = !DISubroutineType(types: !718)
!718 = !{!115, !474}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !720, file: !472, line: 198)
!720 = !DISubprogram(name: "wmemcmp", scope: !478, file: !478, line: 258, type: !675, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !722, file: !472, line: 199)
!722 = !DISubprogram(name: "wmemcpy", scope: !478, file: !478, line: 262, type: !671, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !724, file: !472, line: 200)
!724 = !DISubprogram(name: "wmemmove", scope: !478, file: !478, line: 267, type: !725, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!725 = !DISubroutineType(types: !726)
!726 = !{!537, !537, !550, !60}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !728, file: !472, line: 201)
!728 = !DISubprogram(name: "wmemset", scope: !478, file: !478, line: 271, type: !729, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!729 = !DISubroutineType(types: !730)
!730 = !{!537, !537, !538, !60}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !732, file: !472, line: 202)
!732 = !DISubprogram(name: "wprintf", scope: !478, file: !478, line: 587, type: !733, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DISubroutineType(types: !734)
!734 = !{!115, !549, null}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !736, file: !472, line: 203)
!736 = !DISubprogram(name: "wscanf", scope: !478, file: !478, line: 628, type: !733, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !738, file: !472, line: 204)
!738 = !DISubprogram(name: "wcschr", scope: !478, file: !478, line: 164, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DISubroutineType(types: !740)
!740 = !{!537, !550, !538}
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !742, file: !472, line: 205)
!742 = !DISubprogram(name: "wcspbrk", scope: !478, file: !478, line: 201, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!743 = !DISubroutineType(types: !744)
!744 = !{!537, !550, !550}
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !746, file: !472, line: 206)
!746 = !DISubprogram(name: "wcsrchr", scope: !478, file: !478, line: 174, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !748, file: !472, line: 207)
!748 = !DISubprogram(name: "wcsstr", scope: !478, file: !478, line: 212, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !750, file: !472, line: 208)
!750 = !DISubprogram(name: "wmemchr", scope: !478, file: !478, line: 253, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DISubroutineType(types: !752)
!752 = !{!537, !550, !538, !60}
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !754, file: !472, line: 248)
!754 = !DISubprogram(name: "wcstold", scope: !478, file: !478, line: 384, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!755 = !DISubroutineType(types: !756)
!756 = !{!757, !549, !692}
!757 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !759, file: !472, line: 257)
!759 = !DISubprogram(name: "wcstoll", scope: !478, file: !478, line: 441, type: !760, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!760 = !DISubroutineType(types: !761)
!761 = !{!762, !549, !692, !115}
!762 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !764, file: !472, line: 258)
!764 = !DISubprogram(name: "wcstoull", scope: !478, file: !478, line: 448, type: !765, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !549, !692, !115}
!767 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !754, file: !472, line: 264)
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !759, file: !472, line: 265)
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !764, file: !472, line: 266)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !695, file: !472, line: 280)
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !621, file: !472, line: 283)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !627, file: !472, line: 286)
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !635, file: !472, line: 289)
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !754, file: !472, line: 293)
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !759, file: !472, line: 294)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !764, file: !472, line: 295)
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !779, file: !780, line: 57)
!779 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !781, file: !780, line: 79, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !782, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!780 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/exception_ptr.h", directory: "")
!781 = !DINamespace(name: "__exception_ptr", scope: !78)
!782 = !{!783, !784, !788, !791, !792, !797, !798, !802, !807, !811, !815, !818, !819, !822, !825}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !779, file: !780, line: 81, baseType: !248, size: 64)
!784 = !DISubprogram(name: "exception_ptr", scope: !779, file: !780, line: 83, type: !785, scopeLine: 83, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !787, !248}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!788 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !779, file: !780, line: 85, type: !789, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !787}
!791 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !779, file: !780, line: 86, type: !789, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !779, file: !780, line: 88, type: !793, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!793 = !DISubroutineType(types: !794)
!794 = !{!248, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!797 = !DISubprogram(name: "exception_ptr", scope: !779, file: !780, line: 96, type: !789, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!798 = !DISubprogram(name: "exception_ptr", scope: !779, file: !780, line: 98, type: !799, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !787, !801}
!801 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !796, size: 64)
!802 = !DISubprogram(name: "exception_ptr", scope: !779, file: !780, line: 101, type: !803, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !787, !805}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !78, file: !293, line: 235, baseType: !806)
!806 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!807 = !DISubprogram(name: "exception_ptr", scope: !779, file: !780, line: 105, type: !808, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !787, !810}
!810 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !779, size: 64)
!811 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !779, file: !780, line: 118, type: !812, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!812 = !DISubroutineType(types: !813)
!813 = !{!814, !787, !801}
!814 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !779, size: 64)
!815 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !779, file: !780, line: 122, type: !816, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!816 = !DISubroutineType(types: !817)
!817 = !{!814, !787, !810}
!818 = !DISubprogram(name: "~exception_ptr", scope: !779, file: !780, line: 129, type: !789, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !779, file: !780, line: 132, type: !820, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !787, !814}
!822 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !779, file: !780, line: 144, type: !823, scopeLine: 144, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!823 = !DISubroutineType(types: !824)
!824 = !{!101, !795}
!825 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !779, file: !780, line: 153, type: !826, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!826 = !DISubroutineType(types: !827)
!827 = !{!828, !795}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !78, file: !831, line: 88, size: 128, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt9type_info")
!831 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/typeinfo", directory: "")
!832 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !781, entity: !833, file: !780, line: 73)
!833 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !78, file: !780, line: 69, type: !834, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !779}
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !292, file: !837, line: 44)
!837 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/new_allocator.h", directory: "")
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !839, file: !837, line: 45)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !78, file: !293, line: 232, baseType: !399)
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !841, file: !843, line: 53)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !842, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!842 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!843 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/clocale", directory: "")
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !845, file: !843, line: 54)
!845 = !DISubprogram(name: "setlocale", scope: !842, file: !842, line: 122, type: !846, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!846 = !DISubroutineType(types: !847)
!847 = !{!286, !115, !23}
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !849, file: !843, line: 55)
!849 = !DISubprogram(name: "localeconv", scope: !842, file: !842, line: 125, type: !850, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!850 = !DISubroutineType(types: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !854, file: !858, line: 64)
!854 = !DISubprogram(name: "isalnum", scope: !855, file: !855, line: 108, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!855 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!856 = !DISubroutineType(types: !857)
!857 = !{!115, !115}
!858 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cctype", directory: "")
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !860, file: !858, line: 65)
!860 = !DISubprogram(name: "isalpha", scope: !855, file: !855, line: 109, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !862, file: !858, line: 66)
!862 = !DISubprogram(name: "iscntrl", scope: !855, file: !855, line: 110, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !864, file: !858, line: 67)
!864 = !DISubprogram(name: "isdigit", scope: !855, file: !855, line: 111, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !866, file: !858, line: 68)
!866 = !DISubprogram(name: "isgraph", scope: !855, file: !855, line: 113, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !868, file: !858, line: 69)
!868 = !DISubprogram(name: "islower", scope: !855, file: !855, line: 112, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !870, file: !858, line: 70)
!870 = !DISubprogram(name: "isprint", scope: !855, file: !855, line: 114, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !872, file: !858, line: 71)
!872 = !DISubprogram(name: "ispunct", scope: !855, file: !855, line: 115, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !874, file: !858, line: 72)
!874 = !DISubprogram(name: "isspace", scope: !855, file: !855, line: 116, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !876, file: !858, line: 73)
!876 = !DISubprogram(name: "isupper", scope: !855, file: !855, line: 117, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !878, file: !858, line: 74)
!878 = !DISubprogram(name: "isxdigit", scope: !855, file: !855, line: 118, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !880, file: !858, line: 75)
!880 = !DISubprogram(name: "tolower", scope: !855, file: !855, line: 122, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !882, file: !858, line: 76)
!882 = !DISubprogram(name: "toupper", scope: !855, file: !855, line: 125, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !884, file: !858, line: 87)
!884 = !DISubprogram(name: "isblank", scope: !855, file: !855, line: 130, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !886, file: !888, line: 52)
!886 = !DISubprogram(name: "abs", scope: !887, file: !887, line: 837, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!887 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!888 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/std_abs.h", directory: "")
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !890, file: !892, line: 127)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !887, line: 62, baseType: !891)
!891 = !DICompositeType(tag: DW_TAG_structure_type, file: !887, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!892 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstdlib", directory: "")
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !894, file: !892, line: 128)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !887, line: 70, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !887, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !896, identifier: "_ZTS6ldiv_t")
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !895, file: !887, line: 68, baseType: !399, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !895, file: !887, line: 69, baseType: !399, size: 64, offset: 64)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !900, file: !892, line: 130)
!900 = !DISubprogram(name: "abort", scope: !887, file: !887, line: 588, type: !901, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!901 = !DISubroutineType(types: !902)
!902 = !{null}
!903 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !904, file: !892, line: 134)
!904 = !DISubprogram(name: "atexit", scope: !887, file: !887, line: 592, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!905 = !DISubroutineType(types: !906)
!906 = !{!115, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !909, file: !892, line: 137)
!909 = !DISubprogram(name: "at_quick_exit", scope: !887, file: !887, line: 597, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !911, file: !892, line: 140)
!911 = !DISubprogram(name: "atof", scope: !912, file: !912, line: 25, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!912 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!913 = !DISubroutineType(types: !914)
!914 = !{!691, !23}
!915 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !916, file: !892, line: 141)
!916 = !DISubprogram(name: "atoi", scope: !887, file: !887, line: 361, type: !917, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!917 = !DISubroutineType(types: !918)
!918 = !{!115, !23}
!919 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !920, file: !892, line: 142)
!920 = !DISubprogram(name: "atol", scope: !887, file: !887, line: 366, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!921 = !DISubroutineType(types: !922)
!922 = !{!399, !23}
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !924, file: !892, line: 143)
!924 = !DISubprogram(name: "bsearch", scope: !925, file: !925, line: 20, type: !926, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!925 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!926 = !DISubroutineType(types: !927)
!927 = !{!248, !298, !298, !60, !60, !928}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !887, line: 805, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!115, !298, !298}
!932 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !933, file: !892, line: 144)
!933 = !DISubprogram(name: "calloc", scope: !887, file: !887, line: 541, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!934 = !DISubroutineType(types: !935)
!935 = !{!248, !60, !60}
!936 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !937, file: !892, line: 145)
!937 = !DISubprogram(name: "div", scope: !887, file: !887, line: 849, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!938 = !DISubroutineType(types: !939)
!939 = !{!890, !115, !115}
!940 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !941, file: !892, line: 146)
!941 = !DISubprogram(name: "exit", scope: !887, file: !887, line: 614, type: !942, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !115}
!944 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !945, file: !892, line: 147)
!945 = !DISubprogram(name: "free", scope: !887, file: !887, line: 563, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !248}
!948 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !949, file: !892, line: 148)
!949 = !DISubprogram(name: "getenv", scope: !887, file: !887, line: 631, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!950 = !DISubroutineType(types: !951)
!951 = !{!286, !23}
!952 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !953, file: !892, line: 149)
!953 = !DISubprogram(name: "labs", scope: !887, file: !887, line: 838, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!954 = !DISubroutineType(types: !955)
!955 = !{!399, !399}
!956 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !957, file: !892, line: 150)
!957 = !DISubprogram(name: "ldiv", scope: !887, file: !887, line: 851, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!958 = !DISubroutineType(types: !959)
!959 = !{!894, !399, !399}
!960 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !961, file: !892, line: 151)
!961 = !DISubprogram(name: "malloc", scope: !887, file: !887, line: 539, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!962 = !DISubroutineType(types: !963)
!963 = !{!248, !60}
!964 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !965, file: !892, line: 153)
!965 = !DISubprogram(name: "mblen", scope: !887, file: !887, line: 919, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!966 = !DISubroutineType(types: !967)
!967 = !{!115, !23, !60}
!968 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !969, file: !892, line: 154)
!969 = !DISubprogram(name: "mbstowcs", scope: !887, file: !887, line: 930, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!970 = !DISubroutineType(types: !971)
!971 = !{!60, !539, !572, !60}
!972 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !973, file: !892, line: 155)
!973 = !DISubprogram(name: "mbtowc", scope: !887, file: !887, line: 922, type: !974, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!974 = !DISubroutineType(types: !975)
!975 = !{!115, !539, !572, !60}
!976 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !977, file: !892, line: 157)
!977 = !DISubprogram(name: "qsort", scope: !887, file: !887, line: 827, type: !978, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !248, !60, !60, !928}
!980 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !981, file: !892, line: 160)
!981 = !DISubprogram(name: "quick_exit", scope: !887, file: !887, line: 620, type: !942, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!982 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !983, file: !892, line: 163)
!983 = !DISubprogram(name: "rand", scope: !887, file: !887, line: 453, type: !984, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!984 = !DISubroutineType(types: !985)
!985 = !{!115}
!986 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !987, file: !892, line: 164)
!987 = !DISubprogram(name: "realloc", scope: !887, file: !887, line: 549, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!988 = !DISubroutineType(types: !989)
!989 = !{!248, !248, !60}
!990 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !78, entity: !991, file: !892, line: 165)
